import React, { FC, useEffect, useState } from "react";
import { motion, animate, MotionConfig } from "motion/react";

type TAnimateProp = {
  doAnimate: boolean;
  canAnimate: boolean;
};

let MyAnimation: any = null;

const AnimationS: any = [
  //-----Анимация первого текста-----
  [
    "#Frame_0>#textGroup>#text1",
    { fillOpacity: [0, 1], y: [-100, 20, 0] },
    { delay: 1, duration: 0.5, type: "spring" },
  ],
  //---------------------------------
  //-----Анимация первой иконки-----
  [
    "#Frame_0>#group1>#center2>#S1_2",
    { pathLength: [0, 1] },
    { at: "+0.75", duration: 0.5 },
  ],
  [
    "#Frame_0>#group1>#center1>#S1",
    { pathLength: [0, 1], pathOffset: [1, 0] },
    { at: "-0.65", duration: 0.75 },
  ],
  [
    "#Frame_0>#group1>#chel_1",
    { opacity: [0, 1, 0, 1, 0, 1, 0, 1] },
    { at: "+0.5", duration: 1 },
  ],
  ["#Frame_0>#group1>#chel_1", { opacity: [1] }, { duration: 1 }],
  //-----Анимация первой иконки-----
  //-----Анимация первой линии-----
  ["#Frame_0>#lines>#line1>#S1", { pathLength: [0, 1] }, { duration: 0.5 }],
  ["#Frame_0>#lines>#line1>#S1", { pathLength: [1] }, { duration: 1.5 }],
  //-------------------------------
  //-----Вторая иконка-----
  [
    "#Frame_0>#group2>#center2_2>#S1_2",
    { pathLength: [0, 1] },
    { at: "-1.55", duration: 0.5 },
  ],
  [
    "#Frame_0>#group2>#center2_1>#S1",
    { pathLength: [0, 1], pathOffset: [1, 0] },
    { at: "-0.5", duration: 0.75 },
  ],
  //-----------------------
  //----Вторая иконка-----
  [
    "#Frame_0>#group2>#chel_2",
    { opacity: [0, 1, 0, 1, 0, 1] },
    { duration: 0.5 },
  ],
  ["#Frame_0>#group2>#chel_2", { opacity: [1] }, { duration: 2 }],
  //----Вторая иконка-----
  //--Убрать 1-й текст-----
  [
    "#Frame_0>#textGroup>#text1",
    { fillOpacity: [1, 0], y: [0, -100] },
    { at: "-3", duration: 0.5 },
  ],
  //-----------------------
  //------Показать 2-й текст-------
  [
    "#Frame_0>#textGroup>#text2",
    { opacity: [0, 1], x: [-100, 0] },
    { duration: 0.5, type: "spring" },
  ],
  ["#Frame_0>#textGroup>#text2", { opacity: [1] }, { duration: 1 }],
  //-------------------------------
  //-----Анимация второй линии-----
  ["#Frame_0>#lines>#line2>#S1_2", { pathLength: [0, 1] }, { duration: 0.5 }],
  ["#Frame_0>#lines>#line2>#S1_2", { pathLength: [1] }, { duration: 1.5 }],
  //-------------------------------
  //Убрать 2-й текст
  [
    "#Frame_0>#textGroup>#text2",
    { opacity: [1, 0], x: [0, -100] },
    { at: "-2", duration: 0.5, type: "spring" },
  ],
  //--------------------------
  //------Показать 3-й текст-------
  [
    "#Frame_0>#textGroup>#text3",
    { opacity: [0, 1], x: [-100, 0] },
    { duration: 0.5, type: "spring" },
  ],
  [
    "#Frame_0>#textGroup>#text3",
    { opacity: [1] },
    { type: "spring", duration: 1 },
  ],
  //-------------------------------

  //----Третья иконка-----
  [
    "#Frame_0>#group3>#center3_2>#S1_2",
    { pathLength: [0, 1] },
    { at: "-1.55", duration: 0.5 },
  ],
  [
    "#Frame_0>#group3>#center3_1>#S1",
    { pathLength: [0, 1], pathOffset: [1, 0] },
    { at: "-0.5", duration: 0.75 },
  ],

  [
    "#Frame_0>#group3>#chel_3",
    { opacity: [0, 1, 0, 1, 0, 1] },
    { duration: 0.5 },
  ],
  //-----Checked-----
  [
    "#Frame_0>#group3>#check_3>#S10",
    { opacity: [0, 1], pathLength: [0, 1] },
    { duration: 0.55 },
  ],
  //-----------------
  ["#Frame_0>#group3>#chel_3", { opacity: [1] }, { duration: 2 }],
  //----Третья иконка-----
  //----------Третья линия-----
  [
    "#Frame_0>#lines>#line3>#S1_2_2",
    { pathLength: [0, 1] },
    { duration: 0.35 },
  ],
  //--------------------------
  //Убрать 3-й текст-------
  [
    "#Frame_0>#textGroup>#text3",
    { opacity: [1, 0], x: [0, -100] },
    { at: "-0.5", duration: 0.5, type: "spring" },
  ],
  [
    "#Frame_0>#textGroup>#text4",
    { opacity: [0, 1], x: [-100, 0] },
    { type: "spring", duration: 0.5 },
  ],
  //---------------
  //------Четвертая иконка-------------
  [
    "#Frame_0>#group4>#center4_2>#S1_2",
    { pathLength: [0, 1] },
    { duration: 0.5 },
  ],
  [
    "#Frame_0>#group4>#center4_1>#S1",
    { pathLength: [0, 1], pathOffset: [1, 0] },
    { at: "-0.5", duration: 0.75 },
  ],

  [
    "#Frame_0>#group4>#chel_4",
    { opacity: [0, 1, 0, 1, 0, 1] },
    { duration: 0.5 },
  ],
  [
    "#Frame_0>#group4>#hands",
    { opacity: [0, 1, 0, 1, 0, 1] },
    { duration: 0.5 },
  ],
  ["#Frame_0>#group4>#hands", { opacity: [1] }, { duration: 2 }],
  //-------------------
  //четвертая линия
  [
    "#Frame_0>#lines>#line4>#S1_2_2_2",
    { pathLength: [0, 1] },
    { duration: 0.5 },
  ],
  //-------------------
  //-------Текcт-------
  [
    "#Frame_0>#textGroup>#text4",
    { opacity: [1, 0], x: [0, -100] },
    { at: "-0.6", duration: 0.35 },
  ],
  [
    "#Frame_0>#textGroup>#text5",
    { opacity: [0, 1], x: [-100, 0] },
    { type: "spring", duration: 0.5 },
  ],
  //--------------------
  //Пятая иконка
  [
    "#Frame_0>#group5>#center5_1>#S1",
    {
      pathLength: [0, 1],
      stroke: ["#25657F", "#25657F", "#25657F", "#7DBD2E"],
    },
    { duration: 0.5 },
  ],
  [
    "#Frame_0>#group5>#center5_2>#S1_2",
    {
      pathLength: [0, 1],
      pathOffset: [1, 0],
      stroke: ["#25657F", "#25657F", "#25657F", "#7DBD2E"],
    },
    { at: "-0.5", duration: 1 },
  ],
  [
    "#Frame_0>#group5>#chel_5",
    { opacity: [0, 1, 0, 1, 0, 1] },
    { duration: 0.5 },
  ],
  [
    "#Frame_0>#group5>#chel_5 path",
    { fill: ["#25657F", "#7DBD2E"] },
    { duration: 1 },
  ],

  ["#Frame_0>#group5>#chel_5", { opacity: [1] }, { duration: 5 }],
  //-------------------
  ["#Frame_0", { opacity: [1, 0] }, { duration: 2 }],
];

export const SvgInfoGraphics1: FC<TAnimateProp> = ({
  doAnimate,
  canAnimate,
}) => {
  const [animTime, setAnimTime] = useState<number>(0);

  useEffect(() => {
    if (MyAnimation === null) {
      MyAnimation = animate(AnimationS, { repeat: Infinity });
    }
    //Проверить на reduce Motion
    if (!canAnimate) {
      console.log("Reduce Motion detected");
      setAnimTime(25);
      MyAnimation.time = 25;
      MyAnimation.pause();
      return;
    }

    if (doAnimate) {
      MyAnimation.time = animTime;
      MyAnimation.play();
    }
    if (!doAnimate) {
      setAnimTime(MyAnimation.time);
      MyAnimation.pause();
    }
  }, [doAnimate, canAnimate]);

  return (
    <MotionConfig reducedMotion="never">
      <motion.svg
        version="1.1"
        id="Frame_0"
        xmlns="http://www.w3.org/2000/svg"
        xmlnsXlink="http://www.w3.org/1999/xlink"
        width="100%"
        height="100%"
        viewBox="0 0 426 300"
        fill="none"
      >
        <motion.g id="group1">
          <g id="center1">
            <motion.path
              initial={{ pathLength: 0, pathOffset: 0 }}
              id="S1"
              fill="none"
              stroke="#3998bd"
              strokeWidth="3"
              strokeLinejoin="round"
              d="M 99.869 72.270 C 99.869 49.242 81.183 30.666 58.021 30.666 C 34.858 30.666 16.173 49.242 16.173 72.270 C 16.173 95.297 34.858 113.873 58.021 113.873 C 81.183 113.873 99.869 95.297 99.869 72.270 "
            />
          </g>
          <g id="center2">
            <motion.path
              initial={{ pathLength: 0 }}
              id="S1_2"
              fill="none"
              stroke="#3998bd"
              strokeWidth="1"
              strokeLinejoin="round"
              d="M 104.659 72.334 C 104.659 46.649 83.818 25.930 57.983 25.930 C 32.148 25.930 11.307 46.650 11.307 72.334 C 11.307 98.018 32.148 118.737 57.983 118.737 C 83.818 118.737 104.659 98.018 104.659 72.334 "
            />
          </g>
          <motion.g initial={{ opacity: 0 }} id="chel_1">
            <path
              id="S2"
              fill="#005865"
              fillRule="evenodd"
              stroke="none"
              d="M 50.198 62.465 C 50.198 62.464 51.363 58.301 51.363 58.301 C 51.364 58.300 56.466 57.166 56.466 57.166 C 56.467 57.167 63.987 67.400 63.988 67.401 C 63.989 67.401 70.945 74.115 70.946 74.115 C 70.946 74.116 67.133 77.929 67.133 77.929 C 67.132 77.930 62.942 79.180 62.942 79.180 C 62.941 79.179 58.021 72.270 58.021 72.270 C 58.020 72.269 50.199 62.466 50.198 62.465 Z"
            />
            <path
              //id="S3"
              fill="#005865"
              fillRule="evenodd"
              stroke="none"
              d="M 67.692 73.014 C 65.001 73.014 62.830 75.172 62.830 77.847 C 62.830 80.523 65.001 82.681 67.692 82.681 C 70.383 82.681 72.554 80.523 72.554 77.847 C 72.554 75.172 70.383 73.014 67.692 73.014 Z"
            />
            <path
              //id="S4"
              fill="#005865"
              fillRule="evenodd"
              stroke="none"
              d="M 67.446 77.847 C 67.446 77.847 72.492 77.847 72.492 77.847 C 72.492 77.850 72.492 106.907 72.492 106.910 C 72.492 106.910 67.446 106.910 67.446 106.910 C 67.446 106.907 67.446 77.850 67.446 77.847 Z"
            />
            <path
              //id="S5"
              fill="#005865"
              fillRule="evenodd"
              stroke="none"
              d="M 63.553 79.363 C 63.553 79.364 56.873 89.046 56.873 89.046 C 56.873 89.048 59.654 107.145 59.654 107.145 C 59.654 107.145 64.802 106.845 64.802 106.845 C 64.802 106.843 62.158 89.606 62.158 89.606 C 62.159 89.605 67.156 82.311 67.156 82.311 C 67.156 82.311 63.552 79.363 63.553 79.363 Z"
            />
            <path
              //id="S6"
              fill="#005865"
              fillRule="evenodd"
              stroke="none"
              d="M 48.271 47.742 C 44.656 47.742 41.740 50.642 41.740 54.236 C 41.740 57.830 44.656 60.729 48.271 60.729 C 51.887 60.729 54.803 57.830 54.803 54.236 C 54.803 50.642 51.887 47.742 48.271 47.742 Z"
            />
            <path
              //id="S7"
              fill="none"
              stroke="#005763"
              strokeWidth="3"
              strokeLinejoin="round"
              d="M 56.315 58.514 C 60.432 58.896 68.668 59.658 68.668 59.658 C 68.668 59.659 65.015 68.155 65.015 68.155 C 65.016 68.155 68.032 68.812 68.032 68.812 "
            />
            <path
              //id="S8"
              fill="none"
              stroke="#005763"
              strokeWidth="3"
              strokeLinejoin="round"
              d="M 51.688 62.644 C 53.126 67.141 56.002 76.134 56.002 76.135 C 56.001 76.135 46.154 78.374 46.154 78.374 "
            />
            <path
              //id="S9"
              fill="none"
              stroke="#005763"
              strokeWidth="2"
              strokeLinejoin="round"
              d="M 45.368 107.003 C 45.355 97.996 45.328 79.980 45.328 79.980 C 45.328 79.980 45.847 77.946 46.580 77.885 C 47.665 77.795 48.564 80.905 48.564 80.905 "
            />
          </motion.g>
        </motion.g>
        <motion.g id="group2">
          <g id="center2_1">
            <motion.path
              initial={{ pathLength: 0, pathOffset: 0 }}
              id="S1"
              fill="none"
              stroke="#3998bd"
              strokeWidth="3"
              strokeLinejoin="round"
              d="M 223.929 108.693 C 223.929 85.665 205.244 67.089 182.081 67.089 C 158.919 67.089 140.233 85.665 140.233 108.693 C 140.233 131.720 158.919 150.296 182.081 150.296 C 205.244 150.296 223.929 131.720 223.929 108.693 "
            />
          </g>
          <g id="center2_2">
            <motion.path
              initial={{ pathLength: 0, pathOffset: 0 }}
              id="S1_2"
              fill="none"
              stroke="#3998bd"
              strokeWidth="1"
              strokeLinejoin="round"
              d="M 228.719 108.757 C 228.719 83.073 207.878 62.353 182.043 62.353 C 156.209 62.353 135.367 83.073 135.367 108.757 C 135.367 134.441 156.209 155.160 182.043 155.160 C 207.878 155.160 228.719 134.441 228.719 108.757 "
            />
          </g>
          <motion.g initial={{ opacity: 0 }} id="chel_2">
            <path
              id="S1"
              fill="#005865"
              fillRule="evenodd"
              stroke="none"
              d="M 169.247 82.415 C 170.202 81.324 172.782 80.862 172.782 80.862 C 172.783 80.862 183.026 80.862 183.027 80.862 C 183.028 80.862 192.947 80.966 192.948 80.966 C 192.948 80.966 196.123 81.190 197.044 82.166 C 198.136 83.322 198.062 87.094 198.062 87.094 C 198.062 87.097 198.139 109.051 198.139 109.053 C 198.139 109.056 198.139 137.241 198.139 137.244 C 198.137 137.244 183.028 137.244 183.027 137.244 C 183.025 137.244 167.917 137.244 167.915 137.244 C 167.915 137.241 167.915 109.056 167.915 109.053 C 167.915 109.051 167.915 87.751 167.915 87.749 C 167.915 87.748 167.881 83.976 169.247 82.415 Z"
            />
            <path
              id="S1_2"
              fill="#e3e3e3"
              fillRule="evenodd"
              stroke="none"
              d="M 171.601 89.839 C 172.260 89.101 174.040 88.844 174.040 88.844 C 174.041 88.844 183.104 88.844 183.105 88.844 C 183.106 88.844 192.433 88.790 192.434 88.790 C 192.434 88.790 194.029 89.055 194.501 89.564 C 195.463 90.603 195.409 93.951 195.409 93.951 C 195.409 93.953 195.472 111.944 195.472 111.946 C 195.472 111.949 195.472 135.046 195.472 135.049 C 195.471 135.049 183.106 135.049 183.105 135.049 C 183.103 135.049 170.739 135.049 170.738 135.049 C 170.738 135.046 170.738 111.949 170.738 111.946 C 170.738 111.944 170.738 93.375 170.738 93.373 C 170.738 93.373 170.686 90.862 171.601 89.839 Z"
            />
            <path
              fill="#005763"
              d="M 174.724 77.658 C 174.723 77.658 168.485 79.536 167.141 81.428 L 166.182 80.696 C 168.015 78.425 174.723 77.658 174.724 77.658 L 174.724 77.658 Z"
            />
            <path
              fill="#005763"
              d="M 167.141 81.428 C 165.621 83.285 165.530 89.976 165.530 89.976 L 165.530 89.976 C 165.530 89.976 164.424 83.133 166.182 80.696 L 167.141 81.428 Z"
            />
            <path
              fill="none"
              stroke="#005763"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 167.141 81.428 L 166.182 80.696 "
            />
            <path
              fill="#005763"
              d="M 171.127 76.051 C 171.126 76.052 165.976 78.185 164.819 79.922 L 164.159 79.463 C 165.589 77.480 171.126 76.052 171.127 76.051 L 171.127 76.051 Z"
            />
            <path
              fill="#005763"
              d="M 164.819 79.922 C 163.581 81.629 163.405 87.230 163.405 87.230 L 163.405 87.230 C 163.405 87.230 162.785 81.514 164.159 79.463 L 164.819 79.922 Z"
            />
            <path
              fill="none"
              stroke="#005763"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 164.819 79.922 L 164.159 79.463 "
            />
            <path
              fill="#005763"
              d="M 166.616 76.051 C 166.616 76.052 164.066 77.711 163.441 78.642 L 162.784 78.179 C 163.617 77.044 166.616 76.052 166.616 76.051 L 166.616 76.051 Z"
            />
            <path
              fill="#005763"
              d="M 163.441 78.642 C 162.675 79.679 161.980 83.052 161.980 83.052 L 161.980 83.052 C 161.980 83.052 161.894 79.488 162.784 78.179 L 163.441 78.642 Z"
            />
            <path
              fill="none"
              stroke="#005763"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 163.441 78.642 L 162.784 78.179 "
            />
            <path
              fill="#005763"
              d="M 192.189 77.667 C 192.163 77.659 198.841 78.568 200.675 80.838 L 199.716 81.570 C 198.372 79.679 192.105 77.943 192.076 77.934 L 192.189 77.667 Z"
            />
            <path
              fill="#005763"
              d="M 200.675 80.838 C 202.433 83.275 201.387 90.123 201.327 90.058 L 201.327 90.179 C 201.267 90.114 201.236 83.427 199.716 81.570 L 200.675 80.838 Z"
            />
            <path
              fill="none"
              stroke="#005763"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 200.675 80.838 L 199.716 81.570 "
            />
            <path
              fill="#005763"
              d="M 195.810 76.046 C 195.784 76.034 201.267 77.623 202.697 79.605 L 202.037 80.064 C 200.881 78.327 195.677 76.354 195.649 76.342 L 195.810 76.046 Z"
            />
            <path
              fill="#005763"
              d="M 202.697 79.605 C 204.072 81.657 203.596 87.378 203.452 87.228 L 203.452 87.517 C 203.307 87.367 203.276 81.771 202.037 80.064 L 202.697 79.605 Z"
            />
            <path
              fill="none"
              stroke="#005763"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 202.697 79.605 L 202.037 80.064 "
            />
            <path
              fill="#005763"
              d="M 200.241 76.194 C 200.241 76.194 203.240 77.186 204.073 78.321 L 203.416 78.784 C 202.791 77.853 200.241 76.194 200.241 76.194 L 200.241 76.194 Z"
            />
            <path
              fill="#005763"
              d="M 204.073 78.321 C 204.962 79.631 204.876 83.194 204.876 83.194 L 204.876 83.194 C 204.876 83.194 204.181 79.821 203.416 78.784 L 204.073 78.321 Z"
            />
            <path
              fill="none"
              stroke="#005763"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 204.073 78.321 L 203.416 78.784 "
            />
            <path
              //id="S9"
              fill="none"
              stroke="#9f9f9f"
              strokeWidth="1"
              strokeLinejoin="round"
              d="M 185.622 85.070 C 185.622 83.667 184.483 82.534 183.071 82.534 C 181.659 82.534 180.520 83.667 180.520 85.070 C 180.520 86.474 181.659 87.606 183.071 87.606 C 184.483 87.606 185.622 86.474 185.622 85.070 "
            />
            <path
              //id="S10"
              fill="#828a8d"
              fillRule="evenodd"
              stroke="none"
              d="M 172.172 91.223 C 172.173 91.223 184.774 91.223 184.776 91.223 C 184.776 91.224 184.776 94.849 184.776 94.850 C 184.774 94.850 172.173 94.850 172.172 94.850 C 172.172 94.849 172.172 91.224 172.172 91.223 Z"
            />
            <path
              //id="S11"
              fill="#828a8d"
              fillRule="evenodd"
              stroke="none"
              d="M 178.001 98.183 C 178.002 98.183 194.660 98.183 194.662 98.183 C 194.662 98.184 194.662 100.343 194.662 100.343 C 194.660 100.343 178.002 100.343 178.001 100.343 C 178.001 100.343 178.001 98.184 178.001 98.183 Z"
            />
            <path
              //id="S12"
              fill="#828a8d"
              fillRule="evenodd"
              stroke="none"
              d="M 178.174 100.939 C 178.175 100.939 192.323 100.939 192.324 100.939 C 192.324 100.939 192.324 102.996 192.324 102.996 C 192.323 102.996 178.175 102.996 178.174 102.996 C 178.174 102.996 178.174 100.939 178.174 100.939 Z"
            />
            <path
              id="S13"
              fill="#828a8d"
              fillRule="evenodd"
              stroke="none"
              d="M 178.158 104.030 C 178.159 104.030 190.691 103.996 190.692 103.996 C 190.692 103.996 190.692 105.950 190.692 105.950 C 190.691 105.950 178.159 105.984 178.158 105.984 C 178.158 105.984 178.158 104.030 178.158 104.030 Z"
            />
            <path
              id="S14"
              fill="#828a8d"
              fillRule="evenodd"
              stroke="none"
              d="M 172.788 112.841 C 172.790 112.841 194.700 112.841 194.702 112.841 C 194.702 112.841 194.702 114.132 194.702 114.132 C 194.700 114.132 172.790 114.132 172.788 114.132 C 172.788 114.132 172.788 112.841 172.788 112.841 Z"
            />
            <path
              id="S15"
              fill="#828a8d"
              fillRule="evenodd"
              stroke="none"
              d="M 175.904 114.913 C 175.905 114.913 192.972 114.913 192.974 114.913 C 192.974 114.913 192.974 116.151 192.974 116.151 C 192.972 116.151 175.905 116.151 175.904 116.151 C 175.904 116.151 175.904 114.913 175.904 114.913 Z"
            />
            <path
              id="S16"
              fill="#828a8d"
              fillRule="evenodd"
              stroke="none"
              d="M 178.385 116.954 C 178.386 116.954 190.202 116.954 190.204 116.954 C 190.204 116.954 190.204 118.270 190.204 118.271 C 190.202 118.271 178.386 118.271 178.385 118.271 C 178.385 118.270 178.385 116.954 178.385 116.954 Z"
            />
            <path
              id="S14_2"
              fill="#828a8d"
              fillRule="evenodd"
              stroke="none"
              d="M 172.489 123.385 C 172.492 123.385 194.402 123.385 194.404 123.385 C 194.404 123.385 194.404 124.676 194.404 124.676 C 194.402 124.676 172.492 124.676 172.489 124.676 C 172.489 124.676 172.489 123.385 172.489 123.385 Z"
            />
            <path
              id="S14_2_2"
              fill="#828a8d"
              fillRule="evenodd"
              stroke="none"
              d="M 172.440 125.971 C 172.442 125.971 194.352 125.971 194.354 125.971 C 194.354 125.971 194.354 127.263 194.354 127.263 C 194.352 127.263 172.442 127.263 172.440 127.263 C 172.440 127.263 172.440 125.971 172.440 125.971 Z"
            />
            <path
              id="S14_2_3"
              fill="#828a8d"
              fillRule="evenodd"
              stroke="none"
              d="M 172.440 128.906 C 172.442 128.906 194.352 128.906 194.354 128.906 C 194.354 128.906 194.354 130.197 194.354 130.197 C 194.352 130.197 172.442 130.197 172.440 130.197 C 172.440 130.197 172.440 128.906 172.440 128.906 Z"
            />
            <path
              id="S14_2_3_2"
              fill="#828a8d"
              fillRule="evenodd"
              stroke="none"
              d="M 172.440 132.039 C 172.442 132.039 194.352 132.039 194.354 132.039 C 194.354 132.039 194.354 133.330 194.354 133.330 C 194.352 133.330 172.442 133.330 172.440 133.330 C 172.440 133.330 172.440 132.039 172.440 132.039 Z"
            />
            <path
              id="S21"
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinejoin="round"
              d="M 189.002 91.883 C 189.002 91.883 189.002 89.585 189.002 89.585 C 189.002 89.585 193.692 89.585 193.692 89.585 C 193.692 89.585 193.692 91.883 193.692 91.883 C 193.692 91.883 189.002 91.883 189.002 91.883 "
            />
          </motion.g>
        </motion.g>
        <motion.g id="group3">
          <g id="center3_1">
            <motion.path
              initial={{ pathLength: 0 }}
              id="S1"
              fill="none"
              stroke="#3998bd"
              strokeWidth="3"
              strokeLinejoin="round"
              d="M 409.362 151.921 C 409.362 128.894 390.677 110.318 367.514 110.318 C 344.352 110.318 325.666 128.894 325.666 151.921 C 325.666 174.949 344.352 193.525 367.514 193.525 C 390.677 193.525 409.362 174.949 409.362 151.921 "
            />
          </g>
          <g id="center3_2">
            <motion.path
              initial={{ pathLength: 0 }}
              id="S1_2"
              fill="none"
              stroke="#3998bd"
              strokeWidth="1"
              strokeLinejoin="round"
              d="M 414.152 151.985 C 414.152 126.301 393.311 105.582 367.476 105.582 C 341.641 105.582 320.800 126.301 320.800 151.985 C 320.800 177.669 341.641 198.389 367.476 198.389 C 393.311 198.389 414.152 177.669 414.152 151.985 "
            />
          </g>
          <motion.g initial={{ opacity: 0 }} id="chel_3">
            <path
              id="S1"
              fill="none"
              stroke="#25657f"
              strokeWidth="7"
              strokeLinejoin="round"
              d="M 348.846 130.787 C 360.294 130.787 383.188 130.787 383.189 130.787 "
            />
            <path
              id="S2"
              fill="none"
              stroke="#25657f"
              strokeWidth="3"
              strokeLinejoin="round"
              d="M 348.846 144.307 C 356.478 144.307 371.741 144.307 371.741 144.307 "
            />
            <path
              //id="S3"
              fill="none"
              stroke="#25657f"
              strokeWidth="3"
              strokeLinejoin="round"
              d="M 348.846 155.688 C 360.294 155.688 383.188 155.688 383.189 155.688 "
            />
            <path
              //id="S5"
              fill="none"
              stroke="#25657f"
              strokeWidth="3"
              strokeLinejoin="round"
              d="M 348.846 164.915 C 356.478 164.915 371.741 164.915 371.741 164.915 "
            />
            <path
              //id="S6"
              fill="none"
              stroke="#25657f"
              strokeWidth="3"
              strokeLinejoin="round"
              d="M 348.752 174.235 C 352.568 174.235 360.200 174.235 360.200 174.235 "
            />
            <path
              id="S1_2"
              fill="none"
              stroke="#25657f"
              strokeWidth="3"
              strokeLinejoin="round"
              d="M 348.846 139.482 C 358.983 139.451 379.255 139.388 379.256 139.388 "
            />
            <path
              id="S2_2"
              fill="none"
              stroke="#25657f"
              strokeWidth="3"
              strokeLinejoin="round"
              d="M 348.846 148.334 C 358.101 148.334 376.610 148.334 376.611 148.334 "
            />
            <path
              id="S3_2"
              fill="none"
              stroke="#25657f"
              strokeWidth="3"
              strokeLinejoin="round"
              d="M 348.846 160.464 C 361.643 160.399 387.237 160.270 387.238 160.270 "
            />
            <path
              id="S5_2"
              fill="none"
              stroke="#25657f"
              strokeWidth="3"
              strokeLinejoin="round"
              d="M 348.846 169.223 C 354.979 169.223 367.246 169.223 367.246 169.223 "
            />
            <path
              //id="S10"
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinejoin="round"
              d="M 344.746 179.733 C 344.746 179.728 344.746 124.512 344.746 124.507 C 344.751 124.507 390.245 124.507 390.250 124.507 C 390.250 124.512 390.833 179.922 390.833 179.928 C 390.828 179.928 344.751 179.733 344.746 179.733 "
            />
          </motion.g>
          <g id="check_3">
            <motion.path
              initial={{ opacity: 0, pathLength: 0, pathOffset: 0 }}
              //id="S10"
              fill="none"
              stroke="#92b776"
              strokeWidth="7"
              strokeLinecap="round"
              strokeLinejoin="round"
              d="M 338.956 133.662 C 342.609 138.069 349.915 146.884 349.915 146.884 C 349.916 146.881 365.877 117.700 365.877 117.700 "
            />
          </g>
        </motion.g>
        <motion.g id="group4">
          <g id="center4_1">
            <motion.path
              initial={{ pathLength: 0 }}
              id="S1"
              fill="none"
              stroke="#3998bd"
              strokeWidth="3"
              strokeLinejoin="round"
              d="M 273.219 205.520 C 273.219 182.493 254.533 163.916 231.371 163.916 C 208.208 163.916 189.523 182.493 189.523 205.520 C 189.523 228.547 208.208 247.123 231.371 247.123 C 254.533 247.123 273.219 228.547 273.219 205.520 "
            />
          </g>
          <g id="center4_2">
            <motion.path
              initial={{ pathLength: 0 }}
              id="S1_2"
              fill="none"
              stroke="#3998bd"
              strokeWidth="1"
              strokeLinejoin="round"
              d="M 278.009 205.584 C 278.009 179.900 257.168 159.180 231.333 159.180 C 205.498 159.180 184.657 179.900 184.657 205.584 C 184.657 231.268 205.498 251.987 231.333 251.987 C 257.168 251.987 278.009 231.268 278.009 205.584 "
            />
          </g>
          <motion.g initial={{ opacity: 0 }} id="chel_4">
            <path
              id="S1"
              fill="none"
              stroke="#143a4a"
              strokeWidth="2"
              strokeLinejoin="round"
              d="M 199.837 217.623 C 220.726 217.483 262.503 217.202 262.505 217.202 "
            />
            <path
              id="S2"
              fill="none"
              stroke="#143a4a"
              strokeWidth="2"
              strokeLinecap="round"
              strokeLinejoin="round"
              d="M 216.282 229.241 C 213.949 226.020 209.285 219.579 209.285 219.578 C 209.284 219.579 203.360 229.569 203.360 229.569 "
            />
            <path
              id="S2_2"
              fill="none"
              stroke="#143a4a"
              strokeWidth="2"
              strokeLinecap="round"
              strokeLinejoin="round"
              d="M 259.523 229.573 C 257.165 226.213 252.451 219.496 252.450 219.495 C 252.449 219.496 245.387 229.652 245.387 229.652 "
            />
            <path
              //id="S4"
              fill="#25657f"
              fillRule="evenodd"
              stroke="none"
              d="M 209.681 206.088 C 209.684 206.088 239.834 206.088 239.837 206.088 C 239.837 206.089 239.837 213.940 239.837 213.940 C 239.834 213.940 209.684 213.940 209.681 213.940 C 209.680 213.940 208.900 210.170 208.900 210.169 C 208.900 210.169 209.680 206.089 209.681 206.088 Z"
            />
            <path
              //id="S5"
              fill="#25657f"
              fillRule="evenodd"
              stroke="none"
              d="M 241.098 205.322 C 243.038 205.322 244.618 207.221 244.618 209.637 C 244.618 212.053 243.038 213.953 241.098 213.953 C 239.158 213.953 237.578 212.053 237.578 209.637 C 237.578 207.221 239.158 205.322 241.098 205.322 Z"
            />
            <path
              //id="S6"
              fill="#25657f"
              fillRule="evenodd"
              stroke="none"
              d="M 240.495 207.902 C 240.497 207.903 264.891 210.816 264.893 210.816 C 264.893 210.816 264.909 213.839 264.909 213.839 C 264.907 213.839 240.506 213.992 240.503 213.992 C 240.503 213.992 240.495 207.903 240.495 207.902 Z"
            />
            <path
              //id="S7"
              fill="#25657f"
              fillRule="evenodd"
              stroke="none"
              d="M 263.733 211.140 C 263.733 211.140 264.688 210.951 264.689 210.951 C 264.689 210.952 265.719 216.398 265.720 216.399 C 265.719 216.399 264.334 216.634 264.334 216.634 C 264.334 216.633 263.733 211.140 263.733 211.140 Z"
            />
            <path
              //id="S8"
              fill="#25657f"
              fillRule="evenodd"
              stroke="none"
              d="M 203.948 204.335 C 200.622 204.058 197.420 206.761 197.491 210.391 C 197.561 213.915 200.716 216.247 203.948 216.021 C 206.740 215.826 208.931 213.604 209.041 210.562 C 209.159 207.301 206.936 204.585 203.948 204.335 Z"
            />
            <path
              //id="S9"
              fill="none"
              stroke="#25657f"
              strokeWidth="2"
              strokeLinecap="round"
              strokeLinejoin="round"
              d="M 210.701 213.260 C 214.995 215.070 223.582 218.690 223.582 218.690 C 223.584 218.689 238.096 213.110 238.096 213.110 "
            />
          </motion.g>
          <motion.g initial={{ opacity: 0 }} id="hands">
            <path
              fill="#000000"
              d="M 226.569 201.359 C 227.126 201.283 226.591 199.931 226.577 198.880 L 227.875 198.881 C 227.860 199.656 228.410 201.473 227.254 202.462 L 226.569 201.359 Z"
            />
            <path
              fill="#000000"
              d="M 226.577 198.880 C 226.580 198.222 226.408 197.284 226.342 196.525 L 227.635 196.414 C 227.694 197.103 227.872 198.088 227.875 198.881 L 226.577 198.880 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 226.577 198.880 L 227.875 198.881 "
            />
            <path
              fill="#000000"
              d="M 226.342 196.525 C 226.236 195.295 226.121 193.654 226.044 192.425 L 227.340 192.344 C 227.416 193.567 227.530 195.195 227.635 196.414 L 226.342 196.525 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 226.342 196.525 L 227.635 196.414 "
            />
            <path
              fill="#000000"
              d="M 226.044 192.425 C 226.023 191.831 225.384 190.203 226.281 189.334 L 226.837 190.508 C 226.681 190.139 227.268 191.460 227.340 192.344 L 226.044 192.425 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 226.044 192.425 L 227.340 192.344 "
            />
            <path
              fill="#000000"
              d="M 226.281 189.334 C 226.999 189.153 227.994 189.630 228.414 189.994 L 227.543 190.958 C 227.317 190.738 226.696 190.416 226.837 190.508 L 226.281 189.334 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 226.281 189.334 L 226.837 190.508 "
            />
            <path
              fill="#000000"
              d="M 228.414 189.994 C 229.415 191.048 229.188 193.144 229.513 193.304 L 228.772 194.069 C 228.134 193.296 228.155 191.362 227.543 190.958 L 228.414 189.994 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 228.414 189.994 L 227.543 190.958 "
            />
            <path
              fill="#000000"
              d="M 229.513 193.304 C 230.322 194.116 230.067 193.814 230.255 193.734 L 230.614 194.983 C 230.754 194.916 229.819 195.055 228.772 194.069 L 229.513 193.304 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 229.513 193.304 L 228.772 194.069 "
            />
            <path
              fill="#000000"
              d="M 230.256 193.734 C 229.880 194.264 230.160 190.849 229.642 189.652 L 230.846 189.167 C 231.457 190.775 231.172 194.400 230.614 194.983 L 230.256 193.734 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 230.256 193.734 L 230.614 194.983 "
            />
            <path
              fill="#000000"
              d="M 229.642 189.652 C 229.044 188.050 226.305 186.136 225.257 184.742 L 226.302 183.971 C 227.157 185.156 229.994 187.164 230.846 189.167 L 229.642 189.652 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 229.642 189.652 L 230.846 189.167 "
            />
            <path
              fill="#000000"
              d="M 225.257 184.742 C 224.652 183.923 223.506 182.286 222.998 181.079 L 224.197 180.580 C 224.628 181.632 225.709 183.168 226.302 183.971 L 225.257 184.742 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 225.257 184.742 L 226.302 183.971 "
            />
            <path
              fill="#000000"
              d="M 222.998 181.079 C 222.298 179.382 222.044 176.970 221.888 175.227 L 222.819 175.144 C 222.970 176.839 223.549 179.034 224.197 180.580 L 222.998 181.079 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 222.998 181.079 L 224.197 180.580 "
            />
            <path
              fill="#000000"
              d="M 221.888 175.227 C 221.763 173.790 222.512 170.574 222.512 170.574 L 222.512 170.574 C 222.512 170.574 222.698 173.822 222.819 175.144 L 221.888 175.227 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 221.888 175.227 L 222.819 175.144 "
            />
            <path
              fill="#25657f"
              d="M 212.231 170.885 C 212.231 170.885 213.909 174.094 214.336 175.576 L 213.238 175.892 C 212.821 174.444 212.231 170.885 212.231 170.885 L 212.231 170.885 Z"
            />
            <path
              fill="#25657f"
              d="M 214.336 175.576 C 214.730 176.942 215.598 178.733 215.824 180.211 L 214.112 180.470 C 213.915 179.141 213.636 177.273 213.238 175.892 L 214.336 175.576 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 214.336 175.576 L 213.238 175.892 "
            />
            <path
              fill="#25657f"
              d="M 215.824 180.211 C 216.036 181.623 216.174 183.567 216.054 185.026 L 214.329 184.880 C 214.443 183.576 214.314 181.804 214.112 180.470 L 215.824 180.211 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 215.824 180.211 L 214.112 180.470 "
            />
            <path
              fill="#25657f"
              d="M 216.054 185.026 C 215.953 186.069 215.491 187.228 215.438 187.981 L 213.713 187.830 C 213.817 186.788 214.278 185.631 214.329 184.880 L 216.054 185.026 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 216.054 185.026 L 214.329 184.880 "
            />
            <path
              fill="#25657f"
              d="M 215.438 187.981 C 215.339 189.023 215.562 190.534 215.588 191.756 L 213.857 191.791 C 213.838 190.692 213.610 189.103 213.713 187.830 L 215.438 187.981 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 215.438 187.981 L 213.713 187.830 "
            />
            <path
              fill="#25657f"
              d="M 215.588 191.756 C 215.601 192.413 215.588 193.269 215.596 193.895 L 213.865 193.917 C 213.857 193.263 213.870 192.413 213.857 191.791 L 215.588 191.756 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 215.588 191.756 L 213.857 191.791 "
            />
            <path
              fill="#25657f"
              d="M 215.596 193.895 C 215.599 195.105 215.191 196.452 215.586 197.070 L 214.034 197.838 C 213.460 196.498 213.889 194.836 213.865 193.917 L 215.596 193.895 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 215.596 193.895 L 213.865 193.917 "
            />
            <path
              fill="#25657f"
              d="M 215.586 197.070 C 215.694 197.290 215.705 197.442 215.501 197.264 L 215.446 198.995 C 214.627 198.798 214.167 198.107 214.034 197.838 L 215.586 197.070 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 215.586 197.070 L 214.034 197.838 "
            />
            <path
              fill="#25657f"
              d="M 215.501 197.264 C 216.409 197.954 216.542 193.187 216.555 193.069 L 217.150 193.255 C 217.163 193.138 218.078 198.417 215.446 198.995 L 215.501 197.264 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 215.501 197.264 L 215.446 198.995 "
            />
            <path
              fill="#25657f"
              d="M 217.161 193.116 C 217.160 193.110 218.081 195.223 218.209 196.190 L 216.492 196.416 C 216.371 195.494 216.546 193.215 216.545 193.208 L 217.161 193.116 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 217.161 193.116 L 216.545 193.208 "
            />
            <path
              fill="#25657f"
              d="M 218.209 196.190 C 218.365 197.409 218.316 198.912 218.583 199.892 L 216.907 200.327 C 216.592 199.070 216.635 197.476 216.492 196.416 L 218.209 196.190 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 218.209 196.190 L 216.492 196.416 "
            />
            <path
              fill="#25657f"
              d="M 218.583 199.892 C 218.703 200.382 218.666 200.756 218.725 200.644 L 217.752 202.076 C 217.090 201.474 216.987 200.610 216.907 200.327 L 218.583 199.892 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 218.583 199.892 L 216.907 200.327 "
            />
            <path
              fill="#25657f"
              d="M 218.725 200.644 C 218.768 200.711 218.972 200.760 218.906 200.712 L 219.694 202.254 C 219.075 202.489 218.215 202.352 217.752 202.076 L 218.725 200.644 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 218.725 200.644 L 217.752 202.076 "
            />
            <path
              fill="#25657f"
              d="M 218.906 200.712 C 219.870 200.651 218.853 198.343 218.936 196.653 L 220.663 196.777 C 220.541 197.954 221.589 200.855 219.694 202.254 L 218.906 200.712 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 218.906 200.712 L 219.694 202.254 "
            />
            <path
              fill="#25657f"
              d="M 218.936 196.653 C 218.995 195.840 219.622 193.905 219.622 193.913 L 220.211 193.913 C 220.211 193.922 220.725 195.912 220.663 196.777 L 218.936 196.653 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 218.936 196.653 L 220.663 196.777 "
            />
            <path
              fill="#25657f"
              d="M 220.205 193.857 C 220.207 193.867 221.385 197.540 221.745 199.107 L 220.057 199.493 C 219.681 197.851 219.626 193.961 219.628 193.970 L 220.205 193.857 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 220.205 193.857 L 219.628 193.970 "
            />
            <path
              fill="#25657f"
              d="M 221.745 199.107 C 222.000 200.336 221.679 201.818 222.280 201.939 L 221.358 203.404 C 220.016 202.302 220.269 200.303 220.057 199.493 L 221.745 199.107 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 221.745 199.107 L 220.057 199.493 "
            />
            <path
              fill="#25657f"
              d="M 222.280 201.939 C 222.454 202.096 223.003 202.162 223.020 202.031 L 224.040 203.430 C 223.270 203.873 222.014 203.770 221.358 203.404 L 222.280 201.939 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 222.280 201.939 L 221.358 203.404 "
            />
            <path
              fill="#25657f"
              d="M 223.020 202.031 C 223.129 202.269 222.859 201.692 222.867 200.983 L 224.597 201.058 C 224.562 201.380 224.842 202.528 224.040 203.430 L 223.020 202.031 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 223.020 202.031 L 224.040 203.430 "
            />
            <path
              fill="#25657f"
              d="M 222.867 200.983 C 222.920 199.861 222.707 198.272 222.683 197.005 L 224.414 196.975 C 224.432 198.128 224.648 199.761 224.597 201.058 L 222.867 200.983 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 222.867 200.983 L 224.597 201.058 "
            />
            <path
              fill="#25657f"
              d="M 222.683 197.005 C 222.664 195.932 223.236 193.484 223.236 193.491 L 223.929 193.491 C 223.929 193.499 224.396 195.949 224.414 196.975 L 222.683 197.005 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 222.683 197.005 L 224.414 196.975 "
            />
            <path
              fill="#25657f"
              d="M 223.911 193.382 C 223.904 193.362 225.265 195.356 225.539 196.381 L 223.865 196.823 C 223.636 195.942 223.261 193.621 223.254 193.601 L 223.911 193.382 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 223.911 193.382 L 223.254 193.601 "
            />
            <path
              fill="#25657f"
              d="M 225.539 196.381 C 225.775 197.292 225.875 198.446 226.037 199.224 L 224.341 199.572 C 224.159 198.680 224.066 197.566 223.865 196.823 L 225.539 196.381 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 225.539 196.381 L 223.865 196.823 "
            />
            <path
              fill="#25657f"
              d="M 226.037 199.224 C 226.206 200.194 225.909 201.210 226.239 201.141 L 225.305 202.599 C 224.229 201.629 224.477 200.092 224.341 199.572 L 226.037 199.224 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 226.037 199.224 L 224.341 199.572 "
            />
            <path
              fill="#25657f"
              d="M 226.239 201.141 C 226.255 201.206 226.500 201.228 226.454 201.175 L 227.368 202.646 C 226.768 202.939 225.839 202.886 225.306 202.599 L 226.239 201.141 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 226.239 201.141 L 225.306 202.599 "
            />
            <path
              fill="#25657f"
              d="M 226.454 201.175 C 226.912 201.251 226.380 199.977 226.360 198.880 L 228.092 198.881 C 228.072 199.610 228.624 201.505 227.368 202.646 L 226.454 201.175 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 226.454 201.175 L 227.368 202.646 "
            />
            <path
              fill="#25657f"
              d="M 226.360 198.880 C 226.365 198.244 226.194 197.314 226.126 196.544 L 227.851 196.395 C 227.908 197.072 228.087 198.065 228.092 198.881 L 226.360 198.880 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 226.360 198.880 L 228.092 198.881 "
            />
            <path
              fill="#25657f"
              d="M 226.126 196.544 C 226.020 195.311 225.905 193.668 225.828 192.438 L 227.556 192.330 C 227.632 193.553 227.746 195.178 227.851 196.395 L 226.126 196.544 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 226.126 196.544 L 227.851 196.395 "
            />
            <path
              fill="#25657f"
              d="M 225.828 192.438 C 225.816 191.893 225.168 190.214 226.189 189.139 L 226.930 190.704 C 226.897 190.128 227.475 191.399 227.556 192.330 L 225.828 192.438 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 225.828 192.438 L 227.556 192.330 "
            />
            <path
              fill="#25657f"
              d="M 226.189 189.139 C 227.049 188.943 228.107 189.445 228.559 189.834 L 227.398 191.118 C 227.204 190.923 226.645 190.627 226.930 190.704 L 226.189 189.139 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 226.189 189.139 L 226.930 190.704 "
            />
            <path
              fill="#25657f"
              d="M 228.559 189.834 C 229.625 190.996 229.364 193.119 229.637 193.177 L 228.649 194.196 C 227.959 193.321 227.945 191.414 227.398 191.118 L 228.559 189.834 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 228.559 189.834 L 227.398 191.118 "
            />
            <path
              fill="#25657f"
              d="M 229.637 193.177 C 230.406 193.960 229.952 193.631 230.196 193.526 L 230.674 195.191 C 230.869 195.100 229.735 195.211 228.649 194.196 L 229.637 193.177 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 229.637 193.177 L 228.649 194.196 "
            />
            <path
              fill="#25657f"
              d="M 230.196 193.526 C 229.665 194.241 229.944 190.862 229.441 189.732 L 231.047 189.086 C 231.673 190.763 231.387 194.423 230.673 195.191 L 230.196 193.526 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 230.196 193.526 L 230.673 195.191 "
            />
            <path
              fill="#25657f"
              d="M 229.441 189.732 C 228.886 188.198 226.163 186.300 225.083 184.871 L 226.476 183.843 C 227.299 184.993 230.152 187.017 231.047 189.086 L 229.441 189.732 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 229.441 189.732 L 231.047 189.086 "
            />
            <path
              fill="#25657f"
              d="M 225.083 184.871 C 224.476 184.049 223.319 182.395 222.798 181.162 L 224.397 180.497 C 224.815 181.523 225.885 183.043 226.476 183.843 L 225.083 184.871 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 225.083 184.871 L 226.476 183.843 "
            />
            <path
              fill="#25657f"
              d="M 222.798 181.162 C 222.089 179.440 221.890 176.992 221.733 175.241 L 222.974 175.130 C 223.124 176.817 223.757 178.976 224.397 180.497 L 222.798 181.162 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 222.798 181.162 L 224.397 180.497 "
            />
            <path
              fill="#25657f"
              d="M 221.733 175.241 C 221.607 173.784 222.512 170.574 222.512 170.574 L 222.512 170.574 C 222.512 170.574 222.853 173.827 222.974 175.130 L 221.733 175.241 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 221.733 175.241 L 222.974 175.130 "
            />
            <path
              fill="#000000"
              d="M 235.018 202.499 C 233.927 201.443 234.603 199.658 234.642 198.883 L 235.937 198.973 C 235.850 200.020 235.222 201.342 235.766 201.438 L 235.018 202.499 Z"
            />
            <path
              fill="#000000"
              d="M 234.642 198.883 C 234.700 198.091 234.947 197.118 235.053 196.433 L 236.336 196.634 C 236.217 197.388 235.980 198.315 235.937 198.973 L 234.642 198.883 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 234.642 198.883 L 235.937 198.973 "
            />
            <path
              fill="#000000"
              d="M 235.053 196.433 C 235.243 195.222 235.471 193.603 235.633 192.385 L 236.920 192.557 C 236.757 193.779 236.528 195.411 236.336 196.634 L 235.053 196.433 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 235.053 196.433 L 236.336 196.634 "
            />
            <path
              fill="#000000"
              d="M 235.633 192.385 C 235.766 191.509 236.444 190.219 236.270 190.590 L 236.890 189.449 C 237.733 190.373 236.982 191.963 236.920 192.557 L 235.633 192.385 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 235.633 192.385 L 236.920 192.557 "
            />
            <path
              fill="#000000"
              d="M 236.270 190.590 C 236.420 190.507 235.774 190.797 235.531 191.006 L 234.719 189.992 C 235.161 189.652 236.184 189.230 236.890 189.449 L 236.270 190.590 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 236.270 190.590 L 236.890 189.449 "
            />
            <path
              fill="#000000"
              d="M 235.531 191.006 C 234.887 191.384 234.772 193.315 234.086 194.047 L 233.392 193.239 C 233.731 193.090 233.651 190.985 234.719 189.992 L 235.531 191.006 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 235.531 191.006 L 234.719 189.992 "
            />
            <path
              fill="#000000"
              d="M 234.086 194.047 C 232.975 194.975 232.051 194.784 232.190 194.860 L 232.615 193.633 C 232.801 193.724 232.525 194.009 233.392 193.239 L 234.086 194.047 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 234.086 194.047 L 233.392 193.239 "
            />
            <path
              fill="#000000"
              d="M 232.190 194.860 C 231.664 194.238 231.632 190.605 232.353 189.034 L 233.523 189.598 C 232.920 190.769 232.962 194.192 232.615 193.633 L 232.190 194.860 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 232.190 194.860 L 232.615 193.633 "
            />
            <path
              fill="#000000"
              d="M 232.353 189.034 C 233.341 187.084 236.311 185.229 237.250 184.088 L 238.244 184.924 C 237.103 186.258 234.234 188.026 233.523 189.598 L 232.353 189.034 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 232.353 189.034 L 233.523 189.598 "
            />
            <path
              fill="#000000"
              d="M 237.250 184.088 C 237.898 183.317 239.084 181.839 239.589 180.810 L 240.752 181.388 C 240.162 182.564 238.905 184.137 238.244 184.924 L 237.250 184.088 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 237.250 184.088 L 238.244 184.924 "
            />
            <path
              fill="#000000"
              d="M 239.589 180.810 C 240.345 179.299 241.102 177.146 241.370 175.461 L 242.242 175.600 C 241.965 177.330 241.569 179.732 240.752 181.388 L 239.589 180.810 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 239.589 180.810 L 240.752 181.388 "
            />
            <path
              fill="#000000"
              d="M 241.370 175.461 C 241.584 174.144 241.970 170.919 241.970 170.919 L 241.970 170.919 C 241.970 170.919 242.467 174.175 242.242 175.600 L 241.370 175.461 Z"
            />
            <path
              fill="none"
              stroke="#000000"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 241.370 175.461 L 242.242 175.600 "
            />
            <path
              fill="#25657f"
              d="M 252.211 171.766 C 252.210 171.766 251.357 175.289 250.839 176.714 L 249.798 176.336 C 250.327 174.880 252.210 171.766 252.211 171.766 L 252.211 171.766 Z"
            />
            <path
              fill="#25657f"
              d="M 250.839 176.714 C 250.346 178.071 249.953 179.933 249.664 181.250 L 247.973 180.873 C 248.303 179.410 249.309 177.679 249.798 176.336 L 250.839 176.714 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 250.839 176.714 L 249.798 176.336 "
            />
            <path
              fill="#25657f"
              d="M 249.664 181.250 C 249.369 182.572 249.117 184.333 249.140 185.641 L 247.408 185.666 C 247.390 184.204 247.663 182.271 247.973 180.874 L 249.664 181.250 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 249.664 181.250 L 247.973 180.874 "
            />
            <path
              fill="#25657f"
              d="M 249.140 185.641 C 249.138 186.393 249.518 187.571 249.548 188.618 L 247.817 188.648 C 247.816 187.895 247.436 186.714 247.408 185.666 L 249.140 185.641 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 249.140 185.641 L 247.408 185.666 "
            />
            <path
              fill="#25657f"
              d="M 249.548 188.618 C 249.563 189.894 249.225 191.468 249.128 192.564 L 247.404 192.409 C 247.515 191.190 247.843 189.694 247.817 188.648 L 249.548 188.618 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 249.548 188.618 L 247.817 188.648 "
            />
            <path
              fill="#25657f"
              d="M 249.128 192.564 C 249.072 193.185 249.026 194.034 248.972 194.686 L 247.247 194.543 C 247.298 193.919 247.345 193.064 247.404 192.409 L 249.128 192.564 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 249.128 192.564 L 247.404 192.409 "
            />
            <path
              fill="#25657f"
              d="M 248.972 194.686 C 248.884 195.601 249.196 197.284 248.532 198.586 L 247.034 197.718 C 247.473 197.117 247.159 195.751 247.247 194.543 L 248.972 194.686 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 248.972 194.686 L 247.247 194.543 "
            />
            <path
              fill="#25657f"
              d="M 248.532 198.586 C 248.380 198.847 247.879 199.506 247.055 199.657 L 247.091 197.926 C 246.882 198.090 246.910 197.932 247.034 197.718 L 248.532 198.586 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 248.532 198.586 L 247.034 197.718 "
            />
            <path
              fill="#25657f"
              d="M 247.055 199.657 C 244.454 198.929 245.735 193.716 245.738 193.828 L 246.347 193.695 C 246.351 193.808 246.150 198.581 247.091 197.926 L 247.055 199.657 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 247.055 199.657 L 247.091 197.926 "
            />
            <path
              fill="#25657f"
              d="M 246.344 193.841 C 246.346 193.835 246.360 196.128 246.175 197.043 L 244.478 196.698 C 244.673 195.739 245.740 193.688 245.742 193.682 L 246.344 193.841 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 246.344 193.841 L 245.742 193.682 "
            />
            <path
              fill="#25657f"
              d="M 246.175 197.043 C 245.959 198.093 245.891 199.687 245.489 200.924 L 243.847 200.375 C 244.181 199.410 244.237 197.906 244.478 196.699 L 246.175 197.043 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 246.175 197.043 L 244.478 196.699 "
            />
            <path
              fill="#25657f"
              d="M 245.489 200.924 C 245.389 201.204 245.227 202.057 244.533 202.615 L 243.643 201.129 C 243.702 201.236 243.692 200.857 243.847 200.375 L 245.489 200.924 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 245.489 200.924 L 243.847 200.375 "
            />
            <path
              fill="#25657f"
              d="M 244.533 202.615 C 244.056 202.864 243.189 202.955 242.583 202.687 L 243.456 201.192 C 243.383 201.235 243.591 201.196 243.643 201.129 L 244.533 202.615 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 244.533 202.615 L 243.643 201.129 "
            />
            <path
              fill="#25657f"
              d="M 242.583 202.687 C 240.779 201.178 242.028 198.338 241.988 197.155 L 243.720 197.153 C 243.684 198.842 242.508 201.094 243.456 201.192 L 242.583 202.687 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 242.583 202.687 L 243.456 201.192 "
            />
            <path
              fill="#25657f"
              d="M 241.988 197.155 C 241.987 196.289 242.638 194.340 242.638 194.351 L 243.227 194.351 C 243.226 194.364 243.718 196.337 243.720 197.153 L 241.988 197.155 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 241.988 197.155 L 243.720 197.153 "
            />
            <path
              fill="#25657f"
              d="M 243.219 194.417 C 243.219 194.419 242.892 198.308 242.403 199.928 L 240.746 199.426 C 241.214 197.880 242.646 194.285 242.645 194.286 L 243.219 194.417 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 243.219 194.417 L 242.645 194.286 "
            />
            <path
              fill="#25657f"
              d="M 242.403 199.928 C 242.135 200.726 242.248 202.733 240.841 203.752 L 240.004 202.236 C 240.622 202.137 240.405 200.638 240.746 199.426 L 242.403 199.928 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 242.403 199.928 L 240.746 199.426 "
            />
            <path
              fill="#25657f"
              d="M 240.841 203.752 C 240.164 204.081 238.904 204.118 238.160 203.632 L 239.261 202.296 C 239.261 202.423 239.815 202.385 240.004 202.236 L 240.841 203.752 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 240.841 203.752 L 240.004 202.236 "
            />
            <path
              fill="#25657f"
              d="M 238.160 203.632 C 237.416 202.678 237.775 201.547 237.762 201.223 L 239.493 201.269 C 239.452 201.977 239.142 202.539 239.261 202.296 L 238.160 203.632 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 238.160 203.632 L 239.261 202.296 "
            />
            <path
              fill="#25657f"
              d="M 237.762 201.223 C 237.802 199.926 238.131 198.307 238.230 197.157 L 239.955 197.308 C 239.842 198.571 239.519 200.146 239.493 201.269 L 237.762 201.223 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 237.762 201.223 L 239.493 201.269 "
            />
            <path
              fill="#25657f"
              d="M 238.230 197.157 C 238.320 196.134 238.956 193.722 238.959 193.693 L 239.646 193.783 C 239.648 193.755 240.048 196.238 239.955 197.308 L 238.230 197.157 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 238.230 197.157 L 239.955 197.308 "
            />
            <path
              fill="#25657f"
              d="M 239.615 193.886 C 239.614 193.889 239.078 196.194 238.788 197.063 L 237.148 196.507 C 237.492 195.500 238.990 193.588 238.989 193.590 L 239.615 193.886 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 239.615 193.886 L 238.989 193.590 "
            />
            <path
              fill="#25657f"
              d="M 238.788 197.063 C 238.536 197.795 238.364 198.902 238.121 199.782 L 236.453 199.318 C 236.669 198.550 236.849 197.403 237.148 196.507 L 238.788 197.063 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 238.788 197.063 L 237.148 196.507 "
            />
            <path
              fill="#25657f"
              d="M 238.121 199.782 C 237.948 200.295 238.090 201.841 236.957 202.742 L 236.108 201.233 C 236.442 201.309 236.217 200.277 236.453 199.318 L 238.121 199.782 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 238.121 199.782 L 236.453 199.318 "
            />
            <path
              fill="#25657f"
              d="M 236.957 202.742 C 236.409 202.999 235.479 203.003 234.894 202.676 L 235.891 201.261 C 235.837 201.308 236.082 201.299 236.108 201.233 L 236.957 202.742 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 236.957 202.742 L 236.108 201.233 "
            />
            <path
              fill="#25657f"
              d="M 234.894 202.676 C 233.711 201.460 234.395 199.597 234.426 198.868 L 236.153 198.988 C 236.058 200.080 235.438 201.325 235.891 201.261 L 234.894 202.676 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 234.894 202.676 L 235.891 201.261 "
            />
            <path
              fill="#25657f"
              d="M 234.426 198.868 C 234.487 198.054 234.735 197.073 234.839 196.399 L 236.550 196.667 C 236.429 197.433 236.193 198.352 236.153 198.988 L 234.426 198.868 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 234.426 198.868 L 236.153 198.988 "
            />
            <path
              fill="#25657f"
              d="M 234.839 196.399 C 235.029 195.190 235.256 193.573 235.418 192.357 L 237.135 192.585 C 236.972 193.809 236.742 195.443 236.550 196.667 L 234.839 196.399 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 234.839 196.399 L 236.550 196.667 "
            />
            <path
              fill="#25657f"
              d="M 235.418 192.357 C 235.563 191.433 236.229 190.193 236.166 190.780 L 236.994 189.259 C 237.948 190.399 237.185 192.039 237.135 192.585 L 235.418 192.357 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 235.418 192.357 L 237.135 192.585 "
            />
            <path
              fill="#25657f"
              d="M 236.166 190.780 C 236.459 190.720 235.877 190.988 235.666 191.175 L 234.584 189.823 C 235.059 189.461 236.145 189.017 236.994 189.259 L 236.166 190.780 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 236.166 190.780 L 236.994 189.259 "
            />
            <path
              fill="#25657f"
              d="M 235.666 191.175 C 235.093 191.451 234.946 193.352 234.201 194.182 L 233.276 193.104 C 233.558 193.053 233.445 190.919 234.584 189.823 L 235.666 191.175 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 235.666 191.175 L 234.584 189.823 "
            />
            <path
              fill="#25657f"
              d="M 234.201 194.182 C 233.050 195.136 231.926 194.961 232.119 195.064 L 232.686 193.428 C 232.926 193.547 232.450 193.848 233.276 193.104 L 234.201 194.182 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 234.201 194.182 L 233.276 193.104 "
            />
            <path
              fill="#25657f"
              d="M 232.119 195.064 C 231.448 194.246 231.417 190.577 232.158 188.940 L 233.718 189.692 C 233.135 190.796 233.178 194.185 232.686 193.428 L 232.119 195.064 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 232.119 195.064 L 232.686 193.428 "
            />
            <path
              fill="#25657f"
              d="M 232.158 188.940 C 233.192 186.927 236.178 185.057 237.084 183.949 L 238.410 185.063 C 237.235 186.429 234.383 188.183 233.718 189.692 L 232.158 188.940 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 232.158 188.940 L 233.718 189.692 "
            />
            <path
              fill="#25657f"
              d="M 237.084 183.949 C 237.730 183.181 238.905 181.718 239.395 180.714 L 240.946 181.484 C 240.341 182.685 239.072 184.274 238.410 185.063 L 237.084 183.949 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 237.084 183.949 L 238.410 185.063 "
            />
            <path
              fill="#25657f"
              d="M 239.395 180.714 C 240.141 179.227 240.958 177.115 241.225 175.438 L 242.388 175.623 C 242.109 177.361 241.773 179.804 240.946 181.484 L 239.395 180.714 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 239.395 180.714 L 240.946 181.484 "
            />
            <path
              fill="#25657f"
              d="M 241.225 175.438 C 241.437 174.138 241.970 170.919 241.970 170.919 L 241.970 170.919 C 241.970 170.919 242.614 174.180 242.388 175.623 L 241.225 175.438 Z"
            />
            <path
              fill="none"
              stroke="#25657f"
              strokeWidth="1"
              strokeLinecap="butt"
              strokeLinejoin="round"
              d="M 241.225 175.438 L 242.388 175.623 "
            />
          </motion.g>
        </motion.g>
        <g id="group5">
          <motion.g id="center5_1">
            <motion.path
              initial={{ pathLength: 0 }}
              id="S1"
              fill="none"
              stroke="#3998bd"
              strokeWidth="3"
              strokeLinejoin="round"
              d="M 100.189 220.230 C 100.189 197.203 81.503 178.626 58.341 178.626 C 35.178 178.626 16.493 197.203 16.493 220.230 C 16.493 243.257 35.178 261.834 58.341 261.834 C 81.503 261.834 100.189 243.257 100.189 220.230 "
            />
          </motion.g>
          <motion.g id="center5_2">
            <motion.path
              initial={{ pathLength: 0 }}
              id="S1_2"
              fill="none"
              stroke="#3998bd"
              strokeWidth="1"
              strokeLinejoin="round"
              d="M 104.979 220.294 C 104.979 194.610 84.138 173.890 58.303 173.890 C 32.468 173.890 11.627 194.610 11.627 220.294 C 11.627 245.978 32.468 266.697 58.303 266.698 C 84.138 266.698 104.979 245.978 104.979 220.294 "
            />
          </motion.g>
          <motion.g initial={{ opacity: 0 }} id="chel_5">
            <path
              id="S1"
              fill="#25657f"
              fillRule="evenodd"
              stroke="none"
              d="M 52.443 205.792 C 52.443 205.791 58.272 203.266 58.273 203.265 C 58.274 203.266 64.103 205.791 64.103 205.792 C 64.103 205.793 62.219 222.819 62.219 222.820 C 62.219 222.821 64.103 231.639 64.103 231.640 C 64.103 231.640 58.274 232.379 58.273 232.379 C 58.273 232.379 52.443 231.640 52.443 231.640 C 52.443 231.639 54.327 222.779 54.327 222.778 C 54.327 222.777 52.443 205.793 52.443 205.792 Z"
            />
            <path
              id="S2"
              fill="#25657f"
              fillRule="evenodd"
              stroke="none"
              d="M 58.259 190.211 C 54.494 190.211 51.457 193.230 51.457 196.973 C 51.457 200.716 54.494 203.735 58.259 203.735 C 62.024 203.735 65.061 200.716 65.061 196.973 C 65.061 193.230 62.024 190.211 58.259 190.211 Z"
            />
            <path
              id="S3_2"
              fill="#25657f"
              fillRule="evenodd"
              stroke="none"
              d="M 60.388 230.588 C 60.389 230.588 63.656 229.649 63.657 229.649 C 63.657 229.651 69.392 251.232 69.392 251.235 C 69.392 251.235 70.129 252.574 68.557 253.179 C 66.739 253.878 66.354 252.095 66.353 252.095 C 66.353 252.093 60.389 230.590 60.388 230.588 Z"
            />
            <path
              id="S3_3"
              fill="#25657f"
              fillRule="evenodd"
              stroke="none"
              d="M 52.933 229.700 C 52.933 229.700 56.271 230.532 56.271 230.532 C 56.271 230.534 50.810 252.801 50.810 252.803 C 50.810 252.804 50.367 254.528 48.474 253.821 C 46.888 253.229 47.502 251.930 47.502 251.929 C 47.503 251.927 52.932 229.702 52.933 229.700 Z"
            />
            <path
              id="S5_2"
              fill="#25657f"
              fillRule="evenodd"
              stroke="none"
              d="M 53.334 205.434 C 53.332 205.432 37.694 192.638 37.693 192.637 C 37.692 192.637 36.895 191.630 35.871 192.352 C 34.697 193.179 35.547 194.429 35.547 194.429 C 35.549 194.430 52.826 209.159 52.828 209.161 C 52.828 209.161 53.334 205.434 53.334 205.434 Z"
            />
            <path
              id="S5_2_2"
              fill="#25657f"
              fillRule="evenodd"
              stroke="none"
              d="M 63.158 205.456 C 63.160 205.455 78.798 192.661 78.800 192.660 C 78.800 192.660 79.597 191.653 80.621 192.375 C 81.795 193.202 80.945 194.451 80.945 194.452 C 80.943 194.453 63.666 209.182 63.664 209.184 C 63.664 209.183 63.159 205.457 63.158 205.456 Z"
            />
          </motion.g>
        </g>
        <g id="lines">
          <g id="line1">
            <motion.path
              initial={{ pathLength: 0 }}
              id="S1"
              fill="none"
              stroke="#3998bd"
              strokeWidth="2"
              strokeLinejoin="round"
              d="M 104.302 81.332 C 113.358 83.869 131.469 88.943 131.469 88.943 C 131.469 88.943 131.215 85.180 131.215 85.180 C 131.216 85.181 137.984 91.271 137.984 91.271 C 137.983 91.271 129.364 91.699 129.364 91.699 C 129.364 91.699 131.547 88.816 131.547 88.816 "
            />
          </g>
          <g id="line2">
            <motion.path
              initial={{ pathLength: 0 }}
              id="S1_2"
              fill="none"
              stroke="#3998bd"
              strokeWidth="2"
              strokeLinejoin="round"
              d="M 229.150 114.447 C 258.112 120.516 316.036 132.654 316.036 132.654 C 316.036 132.654 315.534 128.455 315.534 128.455 C 315.535 128.456 323.462 134.511 323.462 134.511 C 323.461 134.511 313.596 136.315 313.596 136.315 C 313.597 136.315 316.045 132.620 316.045 132.620 "
            />
          </g>
          <g id="line3">
            <motion.path
              initial={{ pathLength: 0 }}
              id="S1_2_2"
              fill="none"
              stroke="#3998bd"
              strokeWidth="2"
              strokeLinejoin="round"
              d="M 325.475 172.452 C 312.222 177.682 285.717 188.144 285.717 188.144 C 285.717 188.144 285.870 183.952 285.870 183.952 C 285.869 183.952 276.894 192.255 276.894 192.255 C 276.895 192.255 289.084 190.601 289.084 190.601 C 289.084 190.601 285.841 188.193 285.841 188.193 "
            />
          </g>
          <g id="line4">
            <motion.path
              initial={{ pathLength: 0 }}
              id="S1_2_2_2"
              fill="none"
              stroke="#3998bd"
              strokeWidth="2"
              strokeLinejoin="round"
              d="M 184.035 209.440 C 160.429 212.669 113.217 219.128 113.217 219.128 C 113.217 219.127 114.097 215.325 114.097 215.325 C 114.096 215.326 105.292 220.406 105.292 220.406 C 105.293 220.407 114.940 223.065 114.940 223.065 C 114.940 223.064 113.109 219.019 113.109 219.019 "
            />
          </g>
        </g>
        <g id="textGroup">
          <motion.g initial={{ fillOpacity: 0 }} id="text1">
            <path
              id="S1"
              fill="#ff472e"
              fillRule="evenodd"
              stroke="none"
              d="M 306.292 13.753 C 307.442 13.753 308.593 13.753 309.743 13.753 C 309.743 14.742 309.743 15.730 309.743 16.719 C 308.593 16.719 307.442 16.719 306.292 16.719 C 306.292 15.730 306.292 14.742 306.292 13.753 M 309.743 5.779 C 309.743 6.078 309.743 6.377 309.743 6.676 C 308.510 6.676 307.278 6.676 306.045 6.676 C 306.057 5.376 306.167 4.427 306.374 3.829 C 306.582 3.230 307.030 2.709 307.720 2.263 C 308.416 1.811 309.301 1.586 310.375 1.586 C 311.150 1.585 311.828 1.708 312.408 1.952 C 312.987 2.196 313.448 2.538 313.790 2.977 C 314.132 3.410 314.382 3.880 314.541 4.387 C 314.699 4.894 314.779 5.687 314.779 6.767 C 314.779 7.372 314.779 7.976 314.779 8.580 C 314.779 9.404 314.702 10.066 314.550 10.567 C 314.397 11.067 314.065 11.507 313.552 11.885 C 313.039 12.264 312.438 12.453 311.748 12.453 C 310.851 12.453 310.183 12.102 309.743 11.400 C 309.743 11.931 309.743 12.462 309.743 12.993 C 308.593 12.993 307.442 12.993 306.292 12.993 C 306.292 11.635 306.292 10.277 306.292 8.919 C 307.415 8.919 308.538 8.919 309.661 8.919 C 309.673 9.480 309.875 9.761 310.265 9.761 C 310.570 9.761 310.763 9.639 310.842 9.395 C 310.927 9.145 310.970 8.537 310.970 7.573 C 310.970 6.752 310.970 5.931 310.970 5.110 C 310.970 4.567 310.930 4.204 310.851 4.021 C 310.778 3.832 310.628 3.737 310.403 3.737 C 310.122 3.737 309.942 3.862 309.862 4.112 C 309.783 4.357 309.743 4.912 309.743 5.779 M 300.011 2.245 C 300.634 2.245 300.982 1.827 301.055 0.990 C 301.574 0.991 302.093 0.991 302.611 0.990 C 302.575 1.820 302.331 2.489 301.879 2.995 C 301.434 3.502 300.811 3.755 300.011 3.755 C 299.206 3.755 298.580 3.502 298.134 2.995 C 297.695 2.483 297.457 1.814 297.420 0.990 C 297.939 0.991 298.458 0.991 298.977 0.990 C 299.050 1.827 299.395 2.245 300.011 2.245 M 304.616 4.570 C 304.616 8.620 304.616 12.670 304.616 16.719 C 303.542 16.719 302.468 16.719 301.394 16.719 C 301.394 14.531 301.394 12.343 301.394 10.155 C 300.536 12.343 299.679 14.531 298.821 16.719 C 297.698 16.719 296.575 16.719 295.452 16.719 C 295.452 12.670 295.452 8.620 295.452 4.570 C 296.526 4.570 297.600 4.570 298.675 4.570 C 298.675 6.740 298.675 8.910 298.675 11.080 C 299.517 8.910 300.359 6.740 301.201 4.570 C 302.340 4.570 303.478 4.570 304.616 4.570 M 290.536 13.524 C 290.535 11.656 290.535 9.789 290.536 7.921 C 290.536 7.298 290.502 6.908 290.435 6.749 C 290.368 6.584 290.224 6.502 290.005 6.502 C 289.785 6.502 289.638 6.584 289.565 6.749 C 289.492 6.908 289.455 7.298 289.455 7.921 C 289.455 9.749 289.455 11.577 289.455 13.405 C 289.455 13.979 289.492 14.354 289.565 14.531 C 289.638 14.702 289.782 14.787 289.995 14.787 C 290.215 14.787 290.359 14.708 290.426 14.549 C 290.499 14.391 290.536 14.049 290.536 13.524 M 294.051 6.914 C 294.173 7.335 294.234 7.976 294.234 8.837 C 294.234 9.828 294.234 10.820 294.234 11.812 C 294.234 12.904 294.179 13.707 294.070 14.220 C 293.960 14.726 293.725 15.202 293.365 15.648 C 293.004 16.087 292.541 16.414 291.973 16.628 C 291.411 16.835 290.764 16.939 290.032 16.939 C 289.214 16.939 288.521 16.850 287.954 16.673 C 287.386 16.490 286.944 16.219 286.626 15.859 C 286.315 15.492 286.092 15.053 285.958 14.540 C 285.824 14.021 285.757 13.246 285.757 12.215 C 285.757 11.177 285.757 10.140 285.757 9.102 C 285.757 7.973 285.879 7.091 286.123 6.456 C 286.367 5.821 286.806 5.312 287.441 4.927 C 288.076 4.543 288.888 4.350 289.876 4.350 C 290.707 4.350 291.418 4.476 292.010 4.726 C 292.608 4.970 293.069 5.290 293.392 5.687 C 293.716 6.084 293.935 6.493 294.051 6.914 M 284.548 4.570 C 284.548 8.620 284.548 12.670 284.548 16.719 C 283.321 16.719 282.094 16.719 280.868 16.719 C 280.868 15.227 280.868 13.735 280.868 12.242 C 280.425 12.242 279.983 12.242 279.540 12.242 C 279.540 13.735 279.540 15.227 279.540 16.719 C 278.316 16.719 277.093 16.719 275.869 16.719 C 275.869 12.670 275.869 8.620 275.869 4.570 C 277.093 4.570 278.316 4.570 279.540 4.570 C 279.540 6.026 279.540 7.482 279.540 8.937 C 279.983 8.937 280.425 8.937 280.868 8.937 C 280.868 7.482 280.868 6.026 280.868 4.570 C 282.094 4.570 283.321 4.570 284.548 4.570 M 274.551 4.570 C 274.550 8.620 274.550 12.670 274.551 16.719 C 273.476 16.719 272.402 16.719 271.328 16.719 C 271.328 14.531 271.328 12.343 271.328 10.155 C 270.470 12.343 269.613 14.531 268.755 16.719 C 267.632 16.719 266.509 16.719 265.386 16.719 C 265.386 12.670 265.386 8.620 265.386 4.570 C 266.460 4.570 267.535 4.570 268.609 4.570 C 268.609 6.740 268.609 8.910 268.609 11.080 C 269.451 8.910 270.293 6.740 271.136 4.570 C 272.274 4.570 273.412 4.570 274.551 4.570 M 259.078 16.719 C 257.854 16.719 256.631 16.719 255.407 16.719 C 255.407 12.670 255.407 8.620 255.407 4.570 C 258.294 4.570 261.181 4.570 264.068 4.570 C 264.068 8.620 264.068 12.670 264.068 16.719 C 262.841 16.719 261.614 16.719 260.387 16.719 C 260.387 13.518 260.387 10.317 260.387 7.115 C 259.951 7.115 259.514 7.115 259.078 7.115 C 259.078 10.317 259.078 13.518 259.078 16.719 M 253.969 6.511 C 254.195 7.134 254.308 8.016 254.308 9.157 C 253.145 9.157 251.983 9.157 250.820 9.157 C 250.820 8.690 250.820 8.223 250.820 7.756 C 250.820 7.268 250.780 6.938 250.701 6.767 C 250.622 6.590 250.475 6.502 250.262 6.502 C 250.048 6.502 249.905 6.578 249.831 6.731 C 249.758 6.883 249.721 7.225 249.721 7.756 C 249.721 9.667 249.721 11.577 249.721 13.487 C 249.721 13.921 249.776 14.247 249.886 14.467 C 249.996 14.681 250.158 14.787 250.371 14.787 C 250.622 14.787 250.790 14.674 250.875 14.449 C 250.967 14.223 251.012 13.796 251.012 13.167 C 251.012 12.685 251.012 12.203 251.012 11.720 C 252.111 11.720 253.209 11.720 254.308 11.720 C 254.302 12.691 254.266 13.420 254.198 13.908 C 254.137 14.391 253.933 14.888 253.585 15.401 C 253.243 15.907 252.795 16.292 252.239 16.554 C 251.684 16.811 250.997 16.939 250.179 16.939 C 249.135 16.939 248.308 16.762 247.698 16.408 C 247.088 16.048 246.654 15.547 246.398 14.906 C 246.148 14.259 246.023 13.344 246.023 12.160 C 246.023 11.009 246.023 9.859 246.023 8.708 C 246.023 7.677 246.126 6.899 246.334 6.374 C 246.541 5.849 246.984 5.382 247.662 4.973 C 248.339 4.558 249.163 4.350 250.133 4.350 C 251.098 4.350 251.922 4.555 252.605 4.964 C 253.289 5.373 253.744 5.888 253.969 6.511 M 237.911 13.524 C 237.911 11.656 237.911 9.789 237.911 7.921 C 237.911 7.298 237.878 6.908 237.810 6.749 C 237.743 6.584 237.600 6.502 237.380 6.502 C 237.160 6.502 237.014 6.584 236.941 6.749 C 236.867 6.908 236.831 7.298 236.831 7.921 C 236.831 9.749 236.831 11.577 236.831 13.405 C 236.831 13.979 236.867 14.354 236.941 14.531 C 237.014 14.702 237.157 14.787 237.371 14.787 C 237.591 14.787 237.734 14.708 237.801 14.549 C 237.875 14.391 237.911 14.049 237.911 13.524 M 241.427 6.914 C 241.549 7.335 241.610 7.976 241.610 8.837 C 241.610 9.828 241.610 10.820 241.610 11.812 C 241.610 12.904 241.555 13.707 241.445 14.220 C 241.335 14.726 241.100 15.202 240.740 15.648 C 240.380 16.087 239.916 16.414 239.349 16.628 C 238.787 16.835 238.140 16.939 237.408 16.939 C 236.590 16.939 235.897 16.850 235.329 16.673 C 234.762 16.490 234.319 16.219 234.002 15.859 C 233.691 15.492 233.468 15.053 233.334 14.540 C 233.199 14.021 233.132 13.246 233.132 12.215 C 233.132 11.177 233.132 10.140 233.132 9.102 C 233.132 7.973 233.254 7.091 233.498 6.456 C 233.742 5.821 234.182 5.312 234.817 4.927 C 235.451 4.543 236.263 4.350 237.252 4.350 C 238.082 4.350 238.793 4.476 239.385 4.726 C 239.983 4.970 240.444 5.290 240.768 5.687 C 241.091 6.084 241.311 6.493 241.427 6.914 M 231.805 6.511 C 232.030 7.134 232.143 8.016 232.143 9.157 C 230.981 9.157 229.818 9.157 228.655 9.157 C 228.655 8.690 228.655 8.223 228.655 7.756 C 228.655 7.268 228.615 6.938 228.536 6.767 C 228.457 6.590 228.310 6.502 228.097 6.502 C 227.883 6.502 227.740 6.578 227.666 6.731 C 227.593 6.883 227.556 7.225 227.556 7.756 C 227.556 9.667 227.556 11.577 227.556 13.487 C 227.556 13.921 227.611 14.247 227.721 14.467 C 227.831 14.681 227.993 14.787 228.207 14.787 C 228.457 14.787 228.625 14.674 228.710 14.449 C 228.802 14.223 228.847 13.796 228.847 13.167 C 228.847 12.685 228.847 12.203 228.847 11.720 C 229.946 11.720 231.045 11.720 232.143 11.720 C 232.137 12.691 232.101 13.420 232.034 13.908 C 231.972 14.391 231.768 14.888 231.420 15.401 C 231.078 15.907 230.630 16.292 230.074 16.554 C 229.519 16.811 228.832 16.939 228.014 16.939 C 226.971 16.939 226.144 16.762 225.533 16.408 C 224.923 16.048 224.490 15.547 224.233 14.906 C 223.983 14.259 223.858 13.344 223.858 12.160 C 223.858 11.009 223.858 9.859 223.858 8.708 C 223.858 7.677 223.961 6.899 224.169 6.374 C 224.377 5.849 224.819 5.382 225.497 4.973 C 226.174 4.558 226.998 4.350 227.969 4.350 C 228.933 4.350 229.757 4.555 230.440 4.964 C 231.124 5.373 231.579 5.888 231.805 6.511 M 219.363 4.570 C 219.362 8.620 219.362 12.670 219.363 16.719 C 218.139 16.719 216.915 16.719 215.691 16.719 C 215.691 12.670 215.691 8.620 215.691 4.570 C 216.915 4.570 218.139 4.570 219.363 4.570 M 210.619 13.982 C 210.796 13.854 210.885 13.460 210.885 12.801 C 210.885 12.639 210.885 12.477 210.885 12.315 C 210.885 11.687 210.821 11.305 210.693 11.171 C 210.570 11.037 210.216 10.961 209.631 10.942 C 209.630 12.016 209.631 13.091 209.631 14.165 C 210.119 14.165 210.448 14.104 210.619 13.982 M 214.565 12.013 C 214.565 12.425 214.565 12.837 214.565 13.249 C 214.565 14.360 214.434 15.157 214.171 15.639 C 213.915 16.121 213.509 16.423 212.954 16.545 C 212.398 16.661 211.492 16.719 210.235 16.719 C 208.810 16.719 207.384 16.719 205.959 16.719 C 205.959 12.670 205.959 8.620 205.959 4.570 C 207.183 4.570 208.407 4.570 209.631 4.570 C 209.631 5.919 209.631 7.268 209.631 8.617 C 209.832 8.617 210.033 8.617 210.235 8.617 C 211.413 8.617 212.292 8.687 212.871 8.827 C 213.451 8.968 213.879 9.276 214.153 9.752 C 214.428 10.228 214.565 10.982 214.565 12.013 M 204.641 4.570 C 204.641 8.620 204.641 12.670 204.641 16.719 C 203.585 16.719 202.529 16.719 201.473 16.719 C 201.473 13.927 201.473 11.135 201.473 8.342 C 200.960 11.135 200.448 13.927 199.935 16.719 C 199.261 16.719 198.586 16.719 197.912 16.719 C 197.381 13.927 196.850 11.135 196.319 8.342 C 196.319 11.135 196.319 13.927 196.319 16.719 C 195.263 16.719 194.207 16.719 193.151 16.719 C 193.151 12.670 193.151 8.620 193.151 4.570 C 194.680 4.570 196.209 4.570 197.738 4.570 C 198.131 6.807 198.525 9.044 198.919 11.281 C 199.276 9.044 199.633 6.807 199.990 4.570 C 201.540 4.570 203.090 4.570 204.641 4.570 M 187.154 8.882 C 187.514 8.882 187.874 8.882 188.235 8.882 C 188.234 8.586 188.234 8.290 188.235 7.994 C 188.235 7.366 188.201 6.960 188.134 6.777 C 188.067 6.593 187.929 6.502 187.722 6.502 C 187.466 6.502 187.307 6.581 187.246 6.740 C 187.185 6.893 187.154 7.311 187.154 7.994 C 187.154 8.290 187.154 8.586 187.154 8.882 M 191.943 9.249 C 191.942 9.786 191.942 10.323 191.943 10.860 C 190.346 10.860 188.750 10.860 187.154 10.860 C 187.154 11.736 187.154 12.612 187.154 13.487 C 187.154 14.037 187.194 14.391 187.273 14.549 C 187.353 14.708 187.505 14.787 187.731 14.787 C 188.012 14.788 188.198 14.684 188.290 14.476 C 188.387 14.263 188.436 13.854 188.436 13.249 C 188.436 12.715 188.436 12.181 188.436 11.647 C 189.605 11.647 190.774 11.647 191.943 11.647 C 191.942 11.946 191.942 12.245 191.943 12.544 C 191.943 13.295 191.894 13.872 191.796 14.275 C 191.704 14.678 191.485 15.108 191.137 15.566 C 190.789 16.023 190.346 16.368 189.809 16.600 C 189.278 16.826 188.610 16.939 187.804 16.939 C 187.023 16.939 186.333 16.826 185.735 16.600 C 185.137 16.374 184.670 16.066 184.334 15.675 C 184.005 15.279 183.776 14.845 183.648 14.375 C 183.520 13.899 183.456 13.210 183.456 12.306 C 183.456 11.125 183.456 9.944 183.456 8.763 C 183.456 7.701 183.599 6.865 183.886 6.255 C 184.173 5.638 184.643 5.168 185.296 4.845 C 185.949 4.515 186.700 4.350 187.548 4.350 C 188.586 4.350 189.440 4.549 190.111 4.945 C 190.789 5.336 191.262 5.858 191.530 6.511 C 191.805 7.158 191.943 8.071 191.943 9.249 M 182.339 16.719 C 181.115 16.719 179.891 16.719 178.667 16.719 C 178.667 13.518 178.667 10.317 178.667 7.115 C 178.231 7.115 177.795 7.115 177.358 7.115 C 177.358 9.160 177.358 11.205 177.358 13.249 C 177.358 14.366 177.230 15.166 176.974 15.648 C 176.717 16.124 176.311 16.423 175.756 16.545 C 175.207 16.661 174.303 16.719 173.046 16.719 C 172.845 16.719 172.643 16.719 172.442 16.719 C 172.442 16.057 172.442 15.395 172.442 14.733 C 172.912 14.726 173.235 14.668 173.412 14.559 C 173.589 14.443 173.678 14.043 173.678 13.359 C 173.678 10.430 173.678 7.500 173.678 4.570 C 176.565 4.570 179.452 4.570 182.339 4.570 C 182.339 8.620 182.339 12.670 182.339 16.719 M 166.912 5.641 C 167.498 4.927 168.166 4.570 168.917 4.570 C 170.675 4.570 171.593 5.281 171.673 6.703 C 171.709 7.381 171.728 8.125 171.728 8.937 C 171.728 9.926 171.728 10.915 171.728 11.904 C 171.728 13.277 171.636 14.214 171.453 14.714 C 170.916 16.124 169.588 16.829 167.471 16.829 C 166.677 16.829 166.158 16.817 165.914 16.792 C 165.401 16.725 164.965 16.570 164.605 16.326 C 164.031 15.929 163.650 15.389 163.460 14.705 C 163.326 14.204 163.259 13.408 163.259 12.315 C 163.259 9.938 163.259 7.561 163.259 5.184 C 163.259 4.176 163.595 3.359 164.266 2.730 C 164.937 2.095 165.813 1.778 166.894 1.778 C 167.345 1.778 167.992 1.808 168.835 1.869 C 169.677 1.930 170.229 1.961 170.492 1.961 C 170.815 1.961 171.090 1.924 171.316 1.851 C 171.316 2.489 171.315 3.127 171.316 3.764 C 171.017 3.850 170.779 3.893 170.602 3.893 C 170.272 3.893 169.802 3.868 169.192 3.819 C 168.587 3.771 168.154 3.746 167.892 3.746 C 167.391 3.746 167.083 3.984 166.967 4.460 C 166.930 4.601 166.912 4.994 166.912 5.641 M 167.498 14.879 C 167.858 14.879 168.038 14.662 168.038 14.229 C 168.038 12.160 168.038 10.091 168.038 8.022 C 168.038 7.478 168.023 7.143 167.992 7.015 C 167.925 6.734 167.760 6.593 167.498 6.593 C 167.229 6.593 167.062 6.737 166.994 7.024 C 166.964 7.158 166.949 7.491 166.949 8.022 C 166.949 9.960 166.949 11.897 166.949 13.835 C 166.949 14.531 167.132 14.879 167.498 14.879 M 158.343 13.524 C 158.343 11.656 158.343 9.789 158.343 7.921 C 158.343 7.298 158.309 6.908 158.242 6.749 C 158.175 6.584 158.031 6.502 157.812 6.502 C 157.592 6.502 157.445 6.584 157.372 6.749 C 157.299 6.908 157.262 7.298 157.262 7.921 C 157.262 9.749 157.262 11.577 157.262 13.405 C 157.262 13.979 157.299 14.354 157.372 14.531 C 157.445 14.702 157.589 14.787 157.803 14.787 C 158.022 14.787 158.166 14.708 158.233 14.549 C 158.306 14.391 158.343 14.049 158.343 13.524 M 161.858 6.914 C 161.980 7.335 162.041 7.976 162.041 8.837 C 162.041 9.828 162.041 10.820 162.041 11.812 C 162.041 12.904 161.986 13.707 161.877 14.220 C 161.767 14.726 161.532 15.202 161.172 15.648 C 160.811 16.087 160.348 16.414 159.780 16.628 C 159.219 16.835 158.572 16.939 157.839 16.939 C 157.021 16.939 156.329 16.850 155.761 16.673 C 155.193 16.490 154.751 16.219 154.433 15.859 C 154.122 15.492 153.899 15.053 153.765 14.540 C 153.631 14.021 153.564 13.246 153.564 12.215 C 153.564 11.177 153.564 10.140 153.564 9.102 C 153.564 7.973 153.686 7.091 153.930 6.456 C 154.174 5.821 154.613 5.312 155.248 4.927 C 155.883 4.543 156.695 4.350 157.683 4.350 C 158.514 4.350 159.225 4.476 159.817 4.726 C 160.415 4.970 160.876 5.290 161.199 5.687 C 161.523 6.084 161.742 6.493 161.858 6.914 M 148.757 13.313 C 148.757 11.577 148.757 9.841 148.757 8.104 C 148.757 7.353 148.730 6.899 148.675 6.740 C 148.620 6.581 148.467 6.502 148.217 6.502 C 147.973 6.502 147.814 6.593 147.741 6.777 C 147.674 6.960 147.640 7.402 147.640 8.104 C 147.640 9.783 147.640 11.461 147.640 13.139 C 147.640 13.872 147.677 14.330 147.750 14.513 C 147.823 14.696 147.982 14.787 148.226 14.787 C 148.464 14.787 148.611 14.705 148.665 14.540 C 148.726 14.369 148.757 13.960 148.757 13.313 M 143.941 4.570 C 145.196 4.570 146.450 4.570 147.704 4.570 C 147.683 4.927 147.661 5.284 147.640 5.641 C 147.970 5.208 148.333 4.884 148.730 4.671 C 149.126 4.457 149.560 4.350 150.030 4.350 C 150.603 4.350 151.098 4.506 151.513 4.817 C 151.934 5.122 152.196 5.477 152.300 5.879 C 152.404 6.282 152.456 6.966 152.456 7.930 C 152.456 9.636 152.456 11.342 152.456 13.048 C 152.456 14.153 152.389 14.940 152.254 15.410 C 152.126 15.874 151.858 16.246 151.449 16.527 C 151.046 16.801 150.558 16.939 149.984 16.939 C 149.526 16.939 149.102 16.832 148.711 16.618 C 148.321 16.405 147.964 16.087 147.640 15.666 C 147.640 16.594 147.640 17.522 147.640 18.450 C 146.407 18.450 145.174 18.450 143.941 18.450 C 143.941 13.823 143.941 9.197 143.941 4.570 M 142.513 1.888 C 142.513 6.832 142.513 11.775 142.513 16.719 C 141.225 16.719 139.937 16.719 138.650 16.719 C 138.650 12.764 138.650 8.809 138.650 4.854 C 138.268 4.854 137.887 4.854 137.505 4.854 C 137.505 8.809 137.505 12.764 137.505 16.719 C 136.217 16.719 134.930 16.719 133.642 16.719 C 133.642 11.775 133.642 6.832 133.642 1.888 C 136.599 1.888 139.556 1.888 142.513 1.888 Z"
            />
          </motion.g>
          <motion.g initial={{ opacity: 0 }} id="text2">
            <path
              id="S1"
              fill="#25657f"
              fillRule="evenodd"
              stroke="none"
              d="M 291.902 2.308 C 292.525 2.308 292.873 1.890 292.946 1.054 C 293.465 1.054 293.984 1.054 294.503 1.054 C 294.466 1.884 294.222 2.552 293.770 3.059 C 293.324 3.565 292.702 3.819 291.902 3.819 C 291.097 3.819 290.471 3.565 290.026 3.059 C 289.586 2.546 289.348 1.878 289.311 1.054 C 289.830 1.054 290.349 1.054 290.868 1.054 C 290.941 1.890 291.286 2.308 291.902 2.308 M 296.508 4.633 C 296.507 8.683 296.507 12.733 296.508 16.783 C 295.433 16.783 294.359 16.783 293.285 16.783 C 293.285 14.594 293.285 12.406 293.285 10.218 C 292.427 12.406 291.570 14.594 290.712 16.783 C 289.589 16.783 288.466 16.783 287.343 16.783 C 287.343 12.733 287.343 8.683 287.343 4.633 C 288.417 4.634 289.492 4.634 290.566 4.633 C 290.566 6.803 290.566 8.973 290.566 11.143 C 291.408 8.973 292.250 6.803 293.093 4.633 C 294.231 4.634 295.369 4.634 296.508 4.633 M 282.427 13.587 C 282.427 11.720 282.427 9.852 282.427 7.984 C 282.427 7.362 282.393 6.971 282.326 6.812 C 282.259 6.648 282.115 6.565 281.896 6.565 C 281.676 6.565 281.529 6.648 281.456 6.812 C 281.383 6.971 281.346 7.362 281.346 7.984 C 281.346 9.812 281.346 11.640 281.346 13.468 C 281.346 14.042 281.383 14.417 281.456 14.594 C 281.529 14.765 281.673 14.851 281.887 14.851 C 282.106 14.851 282.250 14.771 282.317 14.613 C 282.390 14.454 282.427 14.112 282.427 13.587 M 285.942 6.977 C 286.064 7.398 286.125 8.039 286.125 8.900 C 286.125 9.892 286.125 10.884 286.125 11.875 C 286.125 12.968 286.070 13.770 285.961 14.283 C 285.851 14.790 285.616 15.266 285.256 15.711 C 284.896 16.151 284.432 16.477 283.864 16.691 C 283.303 16.898 282.656 17.002 281.923 17.002 C 281.105 17.002 280.413 16.914 279.845 16.737 C 279.277 16.554 278.835 16.282 278.517 15.922 C 278.206 15.556 277.983 15.116 277.849 14.604 C 277.715 14.085 277.648 13.310 277.648 12.278 C 277.648 11.241 277.648 10.203 277.648 9.165 C 277.648 8.036 277.770 7.154 278.014 6.519 C 278.258 5.885 278.697 5.375 279.332 4.991 C 279.967 4.606 280.779 4.414 281.768 4.414 C 282.598 4.414 283.309 4.539 283.901 4.789 C 284.499 5.033 284.960 5.354 285.283 5.750 C 285.607 6.147 285.826 6.556 285.942 6.977 M 276.439 4.633 C 276.439 8.683 276.439 12.733 276.439 16.783 C 275.212 16.783 273.986 16.783 272.759 16.783 C 272.759 15.290 272.759 13.798 272.759 12.306 C 272.316 12.306 271.874 12.306 271.431 12.306 C 271.431 13.798 271.431 15.290 271.431 16.783 C 270.207 16.783 268.984 16.783 267.760 16.783 C 267.760 12.733 267.760 8.683 267.760 4.633 C 268.984 4.634 270.207 4.634 271.431 4.633 C 271.431 6.089 271.431 7.545 271.431 9.001 C 271.874 9.001 272.316 9.001 272.759 9.001 C 272.759 7.545 272.759 6.089 272.759 4.633 C 273.986 4.634 275.212 4.634 276.439 4.633 M 266.442 4.633 C 266.441 8.683 266.441 12.733 266.442 16.783 C 265.386 16.783 264.330 16.783 263.274 16.783 C 263.274 13.990 263.274 11.198 263.274 8.405 C 262.761 11.198 262.248 13.990 261.736 16.783 C 261.061 16.783 260.387 16.783 259.713 16.783 C 259.181 13.990 258.650 11.198 258.119 8.405 C 258.119 11.198 258.119 13.990 258.119 16.783 C 257.063 16.783 256.008 16.783 254.952 16.783 C 254.952 12.733 254.952 8.683 254.952 4.633 C 256.481 4.634 258.010 4.634 259.539 4.633 C 259.932 6.871 260.326 9.107 260.720 11.344 C 261.077 9.107 261.434 6.871 261.791 4.633 C 263.341 4.634 264.891 4.634 266.442 4.633 M 246.730 13.587 C 246.730 11.720 246.730 9.852 246.730 7.984 C 246.730 7.362 246.697 6.971 246.630 6.812 C 246.562 6.648 246.419 6.565 246.199 6.565 C 245.980 6.565 245.833 6.648 245.760 6.812 C 245.687 6.971 245.650 7.362 245.650 7.984 C 245.650 9.812 245.650 11.640 245.650 13.468 C 245.650 14.042 245.687 14.417 245.760 14.594 C 245.833 14.765 245.977 14.851 246.190 14.851 C 246.410 14.851 246.553 14.771 246.620 14.613 C 246.694 14.454 246.730 14.112 246.730 13.587 M 250.246 6.977 C 250.368 7.398 250.429 8.039 250.429 8.900 C 250.429 9.892 250.429 10.884 250.429 11.875 C 250.429 12.968 250.374 13.770 250.264 14.283 C 250.154 14.790 249.919 15.266 249.559 15.711 C 249.199 16.151 248.735 16.477 248.168 16.691 C 247.606 16.898 246.959 17.002 246.227 17.002 C 245.409 17.002 244.716 16.914 244.149 16.737 C 243.581 16.554 243.138 16.282 242.821 15.922 C 242.510 15.556 242.287 15.116 242.153 14.604 C 242.018 14.085 241.951 13.310 241.951 12.278 C 241.951 11.241 241.951 10.203 241.951 9.165 C 241.951 8.036 242.073 7.154 242.318 6.519 C 242.562 5.885 243.001 5.375 243.636 4.991 C 244.271 4.606 245.082 4.414 246.071 4.414 C 246.901 4.414 247.612 4.539 248.204 4.789 C 248.802 5.033 249.263 5.354 249.587 5.750 C 249.910 6.147 250.130 6.556 250.246 6.977 M 240.624 6.574 C 240.850 7.197 240.963 8.079 240.963 9.220 C 239.800 9.220 238.637 9.220 237.474 9.220 C 237.474 8.753 237.474 8.287 237.474 7.819 C 237.474 7.331 237.435 7.002 237.355 6.831 C 237.276 6.654 237.129 6.565 236.916 6.565 C 236.702 6.565 236.559 6.641 236.486 6.794 C 236.412 6.947 236.376 7.288 236.376 7.819 C 236.376 9.730 236.376 11.640 236.376 13.551 C 236.376 13.984 236.431 14.311 236.541 14.530 C 236.650 14.744 236.812 14.851 237.026 14.851 C 237.276 14.851 237.444 14.738 237.529 14.512 C 237.621 14.286 237.667 13.859 237.667 13.230 C 237.667 12.748 237.667 12.266 237.667 11.784 C 238.765 11.784 239.864 11.784 240.963 11.784 C 240.956 12.754 240.920 13.484 240.853 13.972 C 240.792 14.454 240.587 14.952 240.239 15.464 C 239.897 15.971 239.449 16.355 238.893 16.618 C 238.338 16.874 237.651 17.002 236.833 17.002 C 235.790 17.002 234.963 16.825 234.352 16.471 C 233.742 16.111 233.309 15.611 233.052 14.970 C 232.802 14.323 232.677 13.407 232.677 12.223 C 232.677 11.073 232.677 9.922 232.677 8.772 C 232.677 7.740 232.781 6.962 232.988 6.437 C 233.196 5.912 233.638 5.445 234.316 5.036 C 234.993 4.621 235.817 4.414 236.788 4.414 C 237.752 4.414 238.576 4.618 239.260 5.027 C 239.943 5.436 240.398 5.952 240.624 6.574 M 223.494 9.632 C 223.677 9.809 224.007 9.898 224.483 9.898 C 224.483 8.930 224.483 7.963 224.483 6.996 C 224.358 6.996 224.233 6.996 224.108 6.996 C 223.839 6.996 223.625 7.075 223.467 7.234 C 223.308 7.386 223.229 7.749 223.229 8.323 C 223.229 8.375 223.229 8.427 223.229 8.479 C 223.229 9.065 223.317 9.449 223.494 9.632 M 228.163 4.633 C 228.163 8.683 228.163 12.733 228.163 16.783 C 226.936 16.783 225.710 16.783 224.483 16.783 C 224.483 15.190 224.483 13.597 224.483 12.003 C 224.007 12.003 223.677 12.104 223.494 12.306 C 223.317 12.507 223.229 12.885 223.229 13.441 C 223.229 14.555 223.229 15.669 223.229 16.783 C 222.099 16.783 220.970 16.783 219.841 16.783 C 219.841 15.834 219.841 14.884 219.841 13.935 C 219.841 13.209 219.881 12.687 219.960 12.370 C 220.040 12.046 220.220 11.793 220.500 11.610 C 220.787 11.427 221.273 11.244 221.956 11.061 C 221.071 10.981 220.497 10.731 220.235 10.310 C 219.972 9.883 219.841 9.123 219.841 8.030 C 219.841 6.822 220.189 5.955 220.885 5.430 C 221.587 4.899 223.101 4.633 225.426 4.633 C 226.338 4.634 227.251 4.634 228.163 4.633 M 218.459 6.574 C 218.685 7.197 218.798 8.079 218.798 9.220 C 217.635 9.220 216.472 9.220 215.309 9.220 C 215.309 8.753 215.309 8.287 215.309 7.819 C 215.309 7.331 215.270 7.002 215.190 6.831 C 215.111 6.654 214.965 6.565 214.751 6.565 C 214.537 6.565 214.394 6.641 214.321 6.794 C 214.247 6.947 214.211 7.288 214.211 7.819 C 214.211 9.730 214.211 11.640 214.211 13.551 C 214.211 13.984 214.266 14.311 214.376 14.530 C 214.485 14.744 214.647 14.851 214.861 14.851 C 215.111 14.851 215.279 14.738 215.364 14.512 C 215.456 14.286 215.502 13.859 215.502 13.230 C 215.502 12.748 215.502 12.266 215.502 11.784 C 216.600 11.784 217.699 11.784 218.798 11.784 C 218.791 12.754 218.755 13.484 218.688 13.972 C 218.627 14.454 218.422 14.952 218.074 15.464 C 217.733 15.971 217.284 16.355 216.728 16.618 C 216.173 16.874 215.486 17.002 214.669 17.002 C 213.625 17.002 212.798 16.825 212.187 16.471 C 211.577 16.111 211.144 15.611 210.887 14.970 C 210.637 14.323 210.512 13.407 210.512 12.223 C 210.512 11.073 210.512 9.922 210.512 8.772 C 210.512 7.740 210.616 6.962 210.823 6.437 C 211.031 5.912 211.473 5.445 212.151 5.036 C 212.828 4.621 213.652 4.414 214.623 4.414 C 215.587 4.414 216.411 4.618 217.095 5.027 C 217.778 5.436 218.233 5.952 218.459 6.574 M 205.495 14.045 C 205.672 13.917 205.760 13.523 205.760 12.864 C 205.760 12.702 205.760 12.541 205.760 12.379 C 205.760 11.750 205.696 11.369 205.568 11.234 C 205.446 11.100 205.092 11.024 204.506 11.006 C 204.506 12.080 204.506 13.154 204.506 14.228 C 204.994 14.228 205.324 14.167 205.495 14.045 M 209.441 12.077 C 209.441 12.489 209.441 12.901 209.441 13.313 C 209.441 14.423 209.310 15.220 209.047 15.702 C 208.791 16.184 208.385 16.487 207.829 16.609 C 207.274 16.725 206.368 16.783 205.110 16.783 C 203.685 16.783 202.260 16.783 200.835 16.783 C 200.835 12.733 200.835 8.683 200.835 4.633 C 202.059 4.634 203.282 4.634 204.506 4.633 C 204.506 5.982 204.506 7.331 204.506 8.680 C 204.708 8.680 204.909 8.680 205.110 8.680 C 206.288 8.680 207.167 8.750 207.747 8.891 C 208.327 9.031 208.754 9.339 209.029 9.815 C 209.304 10.291 209.441 11.045 209.441 12.077 M 192.165 4.633 C 194.808 4.634 197.450 4.634 200.093 4.633 C 200.093 5.482 200.093 6.330 200.093 7.179 C 199.388 7.179 198.683 7.179 197.978 7.179 C 197.978 10.380 197.978 13.581 197.978 16.783 C 196.749 16.783 195.519 16.783 194.289 16.783 C 194.289 13.581 194.289 10.380 194.289 7.179 C 193.581 7.179 192.873 7.179 192.165 7.179 C 192.165 6.330 192.165 5.482 192.165 4.633 M 187.798 13.505 C 187.798 12.672 187.798 11.839 187.798 11.006 C 187.206 11.439 186.861 11.802 186.763 12.095 C 186.672 12.388 186.626 12.809 186.626 13.358 C 186.626 13.987 186.666 14.393 186.745 14.576 C 186.830 14.759 186.995 14.851 187.239 14.851 C 187.471 14.851 187.621 14.781 187.688 14.640 C 187.761 14.494 187.798 14.115 187.798 13.505 M 186.626 8.067 C 186.626 8.491 186.626 8.915 186.626 9.339 C 185.469 9.339 184.313 9.339 183.156 9.339 C 183.156 9.068 183.156 8.796 183.156 8.525 C 183.156 7.585 183.263 6.861 183.477 6.355 C 183.696 5.842 184.133 5.390 184.786 5.000 C 185.439 4.609 186.287 4.414 187.331 4.414 C 188.582 4.414 189.525 4.637 190.160 5.082 C 190.795 5.522 191.176 6.065 191.304 6.712 C 191.432 7.353 191.497 8.677 191.497 10.685 C 191.497 12.718 191.497 14.750 191.497 16.783 C 190.297 16.783 189.098 16.783 187.899 16.783 C 187.898 16.422 187.898 16.062 187.899 15.702 C 187.673 16.136 187.380 16.462 187.020 16.682 C 186.666 16.895 186.241 17.002 185.747 17.002 C 185.100 17.002 184.505 16.822 183.962 16.462 C 183.425 16.096 183.156 15.299 183.156 14.073 C 183.156 13.740 183.156 13.407 183.156 13.075 C 183.156 12.165 183.299 11.546 183.586 11.216 C 183.873 10.887 184.584 10.502 185.719 10.063 C 186.934 9.587 187.584 9.266 187.670 9.101 C 187.755 8.936 187.798 8.601 187.798 8.094 C 187.798 7.459 187.749 7.047 187.651 6.858 C 187.560 6.663 187.404 6.565 187.184 6.565 C 186.934 6.565 186.778 6.648 186.717 6.812 C 186.656 6.971 186.626 7.389 186.626 8.067 M 181.618 9.458 C 181.398 9.812 180.995 10.084 180.410 10.273 C 180.989 10.456 181.417 10.725 181.691 11.079 C 181.966 11.433 182.103 11.985 182.103 12.736 C 182.103 13.566 182.042 14.170 181.920 14.549 C 181.798 14.921 181.560 15.302 181.206 15.693 C 180.858 16.078 180.379 16.355 179.769 16.526 C 179.158 16.697 178.481 16.783 177.736 16.783 C 176.253 16.783 175.215 16.493 174.623 15.913 C 174.031 15.333 173.735 14.280 173.735 12.754 C 173.735 12.458 173.735 12.162 173.735 11.866 C 174.904 11.866 176.073 11.866 177.242 11.866 C 177.242 12.437 177.242 13.008 177.242 13.578 C 177.242 14.189 177.455 14.494 177.883 14.494 C 178.108 14.494 178.279 14.408 178.395 14.237 C 178.517 14.060 178.578 13.603 178.578 12.864 C 178.578 12.608 178.578 12.351 178.578 12.095 C 178.578 11.741 178.459 11.497 178.221 11.363 C 177.983 11.228 177.489 11.161 176.738 11.161 C 176.738 10.584 176.738 10.008 176.738 9.431 C 176.833 9.431 176.927 9.431 177.022 9.431 C 177.541 9.431 177.880 9.419 178.038 9.394 C 178.197 9.370 178.325 9.284 178.423 9.138 C 178.527 8.985 178.578 8.732 178.578 8.378 C 178.578 8.293 178.578 8.207 178.578 8.122 C 178.578 7.603 178.520 7.273 178.404 7.133 C 178.295 6.993 178.133 6.922 177.919 6.922 C 177.468 6.922 177.242 7.191 177.242 7.728 C 177.242 8.058 177.242 8.387 177.242 8.717 C 176.073 8.717 174.904 8.717 173.735 8.717 C 173.735 8.537 173.735 8.357 173.735 8.177 C 173.735 6.895 174.047 5.985 174.669 5.448 C 175.298 4.905 176.345 4.633 177.809 4.633 C 179.213 4.633 180.254 4.893 180.931 5.412 C 181.609 5.930 181.948 6.733 181.948 7.819 C 181.948 8.552 181.838 9.098 181.618 9.458 M 167.867 9.632 C 168.050 9.809 168.380 9.898 168.856 9.898 C 168.856 8.930 168.856 7.963 168.856 6.996 C 168.730 6.996 168.605 6.996 168.480 6.996 C 168.212 6.996 167.998 7.075 167.839 7.234 C 167.681 7.386 167.601 7.749 167.601 8.323 C 167.601 8.375 167.601 8.427 167.601 8.479 C 167.601 9.065 167.690 9.449 167.867 9.632 M 172.536 4.633 C 172.536 8.683 172.536 12.733 172.536 16.783 C 171.309 16.783 170.082 16.783 168.856 16.783 C 168.856 15.190 168.856 13.597 168.856 12.003 C 168.380 12.003 168.050 12.104 167.867 12.306 C 167.690 12.507 167.601 12.885 167.601 13.441 C 167.601 14.555 167.601 15.669 167.601 16.783 C 166.472 16.783 165.343 16.783 164.214 16.783 C 164.214 15.834 164.214 14.884 164.214 13.935 C 164.214 13.209 164.253 12.687 164.333 12.370 C 164.412 12.046 164.592 11.793 164.873 11.610 C 165.160 11.427 165.645 11.244 166.329 11.061 C 165.444 10.981 164.870 10.731 164.607 10.310 C 164.345 9.883 164.214 9.123 164.214 8.030 C 164.214 6.822 164.562 5.955 165.258 5.430 C 165.959 4.899 167.473 4.633 169.799 4.633 C 170.711 4.634 171.623 4.634 172.536 4.633 M 159.279 14.018 C 159.438 13.871 159.517 13.535 159.517 13.011 C 159.517 12.873 159.517 12.736 159.517 12.599 C 159.517 12.074 159.447 11.747 159.307 11.619 C 159.166 11.485 158.831 11.418 158.299 11.418 C 158.299 12.354 158.299 13.291 158.299 14.228 C 158.794 14.228 159.120 14.158 159.279 14.018 M 158.299 7.179 C 158.299 7.835 158.299 8.491 158.299 9.147 C 158.861 9.147 159.203 9.077 159.325 8.936 C 159.453 8.796 159.517 8.518 159.517 8.103 C 159.517 7.755 159.447 7.514 159.307 7.380 C 159.166 7.246 158.831 7.179 158.299 7.179 M 163.198 12.864 C 163.198 13.102 163.198 13.340 163.198 13.578 C 163.198 14.817 162.926 15.663 162.383 16.114 C 161.846 16.560 160.674 16.783 158.867 16.783 C 157.454 16.783 156.041 16.783 154.628 16.783 C 154.628 12.733 154.628 8.683 154.628 4.633 C 156.084 4.634 157.540 4.634 158.995 4.633 C 160.491 4.634 161.519 4.881 162.081 5.375 C 162.648 5.870 162.932 6.715 162.932 7.911 C 162.932 9.284 162.218 10.066 160.790 10.255 C 161.534 10.377 162.120 10.670 162.547 11.134 C 162.981 11.592 163.198 12.168 163.198 12.864 M 153.356 7.014 C 153.356 7.484 153.356 7.954 153.356 8.424 C 152.071 8.424 150.786 8.424 149.501 8.424 C 149.501 7.563 149.501 6.703 149.501 5.842 C 149.501 5.091 149.459 4.624 149.373 4.441 C 149.294 4.252 149.114 4.157 148.833 4.157 C 148.516 4.157 148.314 4.270 148.229 4.496 C 148.143 4.722 148.101 5.210 148.101 5.961 C 148.101 8.256 148.101 10.551 148.101 12.846 C 148.101 13.566 148.143 14.036 148.229 14.256 C 148.314 14.475 148.506 14.585 148.806 14.585 C 149.092 14.585 149.279 14.475 149.364 14.256 C 149.456 14.036 149.501 13.520 149.501 12.708 C 149.501 12.089 149.501 11.470 149.501 10.850 C 150.786 10.850 152.071 10.850 153.356 10.850 C 153.356 11.042 153.356 11.235 153.356 11.427 C 153.356 12.959 153.246 14.045 153.026 14.686 C 152.812 15.327 152.333 15.888 151.589 16.371 C 150.850 16.853 149.938 17.094 148.851 17.094 C 147.722 17.094 146.791 16.889 146.059 16.480 C 145.327 16.071 144.841 15.507 144.603 14.787 C 144.365 14.060 144.246 12.971 144.246 11.518 C 144.246 10.075 144.246 8.631 144.246 7.188 C 144.246 6.120 144.283 5.320 144.356 4.789 C 144.429 4.252 144.646 3.736 145.006 3.242 C 145.372 2.748 145.876 2.360 146.517 2.079 C 147.164 1.792 147.905 1.649 148.741 1.649 C 149.877 1.649 150.814 1.869 151.552 2.308 C 152.291 2.747 152.776 3.297 153.008 3.956 C 153.240 4.609 153.356 5.628 153.356 7.014 Z"
            />
          </motion.g>
          <motion.g initial={{ opacity: 0 }} id="text3">
            <path
              id="S1"
              fill="#25657f"
              fillRule="evenodd"
              stroke="none"
              d="M 314.236 6.760 C 314.462 7.382 314.575 8.264 314.575 9.405 C 313.412 9.406 312.250 9.406 311.087 9.405 C 311.087 8.939 311.087 8.472 311.087 8.005 C 311.087 7.516 311.047 7.187 310.968 7.016 C 310.888 6.839 310.742 6.750 310.528 6.750 C 310.315 6.750 310.171 6.827 310.098 6.979 C 310.025 7.132 309.988 7.474 309.988 8.005 C 309.988 9.915 309.988 11.826 309.988 13.736 C 309.988 14.169 310.043 14.496 310.153 14.715 C 310.263 14.929 310.425 15.036 310.638 15.036 C 310.889 15.036 311.056 14.923 311.142 14.697 C 311.233 14.471 311.279 14.044 311.279 13.415 C 311.279 12.933 311.279 12.451 311.279 11.969 C 312.378 11.969 313.476 11.969 314.575 11.969 C 314.569 12.939 314.532 13.669 314.465 14.157 C 314.404 14.639 314.200 15.137 313.852 15.649 C 313.510 16.156 313.061 16.540 312.506 16.803 C 311.951 17.059 311.264 17.187 310.446 17.187 C 309.402 17.187 308.575 17.010 307.965 16.656 C 307.355 16.296 306.921 15.796 306.665 15.155 C 306.415 14.508 306.290 13.592 306.290 12.408 C 306.289 11.258 306.290 10.107 306.290 8.957 C 306.289 7.925 306.393 7.147 306.601 6.622 C 306.808 6.097 307.251 5.630 307.928 5.222 C 308.606 4.806 309.430 4.599 310.400 4.599 C 311.365 4.599 312.189 4.803 312.872 5.212 C 313.556 5.621 314.011 6.137 314.236 6.760 M 305.081 4.819 C 305.081 8.868 305.081 12.918 305.081 16.968 C 303.854 16.968 302.627 16.968 301.401 16.968 C 301.400 15.475 301.400 13.983 301.401 12.491 C 300.958 12.491 300.515 12.491 300.073 12.491 C 300.073 13.983 300.073 15.475 300.073 16.968 C 298.849 16.968 297.626 16.968 296.402 16.968 C 296.402 12.918 296.402 8.868 296.402 4.819 C 297.626 4.819 298.849 4.819 300.073 4.819 C 300.073 6.274 300.073 7.730 300.073 9.186 C 300.516 9.186 300.958 9.186 301.401 9.186 C 301.401 7.730 301.400 6.274 301.401 4.819 C 302.627 4.819 303.854 4.819 305.081 4.819 M 291.431 13.690 C 291.430 12.857 291.430 12.024 291.431 11.191 C 290.838 11.624 290.494 11.987 290.396 12.280 C 290.304 12.573 290.259 12.994 290.259 13.544 C 290.259 14.172 290.298 14.578 290.378 14.761 C 290.463 14.944 290.628 15.036 290.872 15.036 C 291.104 15.036 291.254 14.966 291.321 14.825 C 291.394 14.679 291.431 14.300 291.431 13.690 M 290.259 8.252 C 290.259 8.676 290.259 9.100 290.259 9.524 C 289.102 9.524 287.945 9.524 286.789 9.524 C 286.789 9.253 286.789 8.981 286.789 8.710 C 286.789 7.770 286.896 7.046 287.109 6.540 C 287.329 6.027 287.765 5.576 288.418 5.185 C 289.071 4.794 289.920 4.599 290.964 4.599 C 292.215 4.599 293.158 4.822 293.793 5.267 C 294.427 5.707 294.809 6.250 294.937 6.897 C 295.065 7.538 295.129 8.862 295.129 10.870 C 295.129 12.903 295.129 14.935 295.129 16.968 C 293.930 16.968 292.730 16.968 291.531 16.968 C 291.531 16.608 291.531 16.248 291.531 15.887 C 291.305 16.321 291.012 16.647 290.652 16.867 C 290.298 17.081 289.874 17.187 289.380 17.187 C 288.733 17.187 288.138 17.007 287.594 16.647 C 287.057 16.281 286.789 15.485 286.789 14.258 C 286.789 13.925 286.789 13.593 286.789 13.260 C 286.789 12.350 286.932 11.731 287.219 11.401 C 287.506 11.072 288.217 10.687 289.352 10.248 C 290.567 9.772 291.217 9.451 291.302 9.286 C 291.388 9.122 291.431 8.786 291.431 8.279 C 291.430 7.645 291.382 7.233 291.284 7.043 C 291.192 6.848 291.037 6.750 290.817 6.750 C 290.567 6.750 290.411 6.833 290.350 6.998 C 290.289 7.156 290.259 7.574 290.259 8.252 M 280.957 9.131 C 281.317 9.131 281.677 9.131 282.037 9.131 C 282.037 8.835 282.037 8.539 282.037 8.243 C 282.037 7.614 282.004 7.208 281.937 7.025 C 281.869 6.842 281.732 6.750 281.524 6.750 C 281.268 6.750 281.109 6.830 281.048 6.988 C 280.987 7.141 280.957 7.559 280.957 8.243 C 280.957 8.539 280.957 8.835 280.957 9.131 M 285.745 9.497 C 285.745 10.034 285.745 10.571 285.745 11.108 C 284.149 11.108 282.553 11.108 280.957 11.108 C 280.957 11.984 280.957 12.860 280.957 13.736 C 280.957 14.285 280.997 14.639 281.076 14.798 C 281.155 14.957 281.308 15.036 281.534 15.036 C 281.814 15.036 282.001 14.932 282.092 14.725 C 282.190 14.511 282.239 14.102 282.239 13.498 C 282.239 12.964 282.239 12.430 282.239 11.896 C 283.407 11.896 284.576 11.896 285.745 11.896 C 285.745 12.195 285.745 12.494 285.745 12.793 C 285.745 13.544 285.696 14.120 285.599 14.523 C 285.507 14.926 285.287 15.356 284.939 15.814 C 284.591 16.272 284.149 16.617 283.612 16.849 C 283.081 17.075 282.413 17.187 281.607 17.187 C 280.826 17.187 280.136 17.075 279.538 16.849 C 278.940 16.623 278.473 16.315 278.137 15.924 C 277.807 15.527 277.579 15.094 277.450 14.624 C 277.322 14.148 277.258 13.458 277.258 12.555 C 277.258 11.374 277.258 10.193 277.258 9.012 C 277.258 7.950 277.402 7.114 277.688 6.503 C 277.975 5.887 278.445 5.417 279.098 5.093 C 279.751 4.764 280.502 4.599 281.351 4.599 C 282.388 4.599 283.243 4.797 283.914 5.194 C 284.592 5.585 285.065 6.107 285.333 6.760 C 285.608 7.407 285.745 8.319 285.745 9.497 M 275.931 6.760 C 276.157 7.382 276.269 8.264 276.269 9.405 C 275.107 9.406 273.944 9.406 272.781 9.405 C 272.781 8.939 272.781 8.472 272.781 8.005 C 272.781 7.516 272.742 7.187 272.662 7.016 C 272.583 6.839 272.436 6.750 272.223 6.750 C 272.009 6.750 271.866 6.827 271.793 6.979 C 271.719 7.132 271.683 7.474 271.683 8.005 C 271.682 9.915 271.682 11.826 271.683 13.736 C 271.683 14.169 271.738 14.496 271.847 14.715 C 271.957 14.929 272.119 15.036 272.333 15.036 C 272.583 15.036 272.751 14.923 272.836 14.697 C 272.928 14.471 272.973 14.044 272.973 13.415 C 272.973 12.933 272.973 12.451 272.973 11.969 C 274.072 11.969 275.171 11.969 276.269 11.969 C 276.263 12.939 276.227 13.669 276.159 14.157 C 276.098 14.639 275.894 15.137 275.546 15.649 C 275.204 16.156 274.756 16.540 274.200 16.803 C 273.645 17.059 272.958 17.187 272.140 17.187 C 271.097 17.187 270.270 17.010 269.659 16.656 C 269.049 16.296 268.615 15.796 268.359 15.155 C 268.109 14.508 267.984 13.592 267.984 12.408 C 267.984 11.258 267.984 10.107 267.984 8.957 C 267.984 7.925 268.088 7.147 268.295 6.622 C 268.503 6.097 268.945 5.630 269.623 5.222 C 270.300 4.806 271.124 4.599 272.095 4.599 C 273.059 4.599 273.883 4.803 274.566 5.212 C 275.250 5.621 275.705 6.137 275.931 6.760 M 259.817 13.690 C 259.817 12.857 259.817 12.024 259.817 11.191 C 259.225 11.624 258.881 11.987 258.783 12.280 C 258.691 12.573 258.645 12.994 258.645 13.544 C 258.645 14.172 258.685 14.578 258.765 14.761 C 258.850 14.944 259.015 15.036 259.259 15.036 C 259.491 15.036 259.640 14.966 259.707 14.825 C 259.781 14.679 259.817 14.300 259.817 13.690 M 258.645 8.252 C 258.645 8.676 258.645 9.100 258.645 9.524 C 257.489 9.524 256.332 9.524 255.176 9.524 C 255.176 9.253 255.176 8.981 255.176 8.710 C 255.176 7.770 255.282 7.046 255.496 6.540 C 255.716 6.027 256.152 5.576 256.805 5.185 C 257.458 4.794 258.307 4.599 259.350 4.599 C 260.602 4.599 261.545 4.822 262.179 5.267 C 262.814 5.707 263.196 6.250 263.324 6.897 C 263.452 7.538 263.516 8.862 263.516 10.870 C 263.516 12.903 263.516 14.935 263.516 16.968 C 262.317 16.968 261.117 16.968 259.918 16.968 C 259.918 16.608 259.918 16.248 259.918 15.887 C 259.692 16.321 259.399 16.647 259.039 16.867 C 258.685 17.081 258.261 17.187 257.767 17.187 C 257.120 17.187 256.525 17.007 255.981 16.647 C 255.444 16.281 255.176 15.485 255.176 14.258 C 255.176 13.925 255.176 13.593 255.176 13.260 C 255.176 12.350 255.319 11.731 255.606 11.401 C 255.893 11.072 256.604 10.687 257.739 10.248 C 258.954 9.772 259.604 9.451 259.689 9.286 C 259.775 9.122 259.817 8.786 259.817 8.279 C 259.817 7.645 259.769 7.233 259.671 7.043 C 259.579 6.848 259.424 6.750 259.204 6.750 C 258.954 6.750 258.798 6.833 258.737 6.998 C 258.676 7.156 258.645 7.574 258.645 8.252 M 254.022 4.819 C 254.022 8.868 254.022 12.918 254.022 16.968 C 252.795 16.968 251.568 16.968 250.342 16.968 C 250.342 15.475 250.342 13.983 250.342 12.491 C 249.899 12.491 249.457 12.491 249.014 12.491 C 249.014 13.983 249.014 15.475 249.014 16.968 C 247.790 16.968 246.567 16.968 245.343 16.968 C 245.343 12.918 245.343 8.868 245.343 4.819 C 246.567 4.819 247.790 4.819 249.014 4.819 C 249.014 6.274 249.014 7.730 249.014 9.186 C 249.457 9.186 249.899 9.186 250.342 9.186 C 250.342 7.730 250.342 6.274 250.342 4.819 C 251.568 4.819 252.795 4.819 254.022 4.819 M 236.050 9.818 C 236.233 9.995 236.563 10.083 237.039 10.083 C 237.039 9.116 237.039 8.148 237.039 7.181 C 236.914 7.181 236.789 7.181 236.664 7.181 C 236.395 7.181 236.181 7.260 236.023 7.419 C 235.864 7.571 235.785 7.934 235.785 8.508 C 235.785 8.560 235.785 8.612 235.785 8.664 C 235.785 9.250 235.873 9.634 236.050 9.818 M 240.719 4.819 C 240.719 8.868 240.719 12.918 240.719 16.968 C 239.493 16.968 238.266 16.968 237.039 16.968 C 237.039 15.375 237.039 13.782 237.039 12.189 C 236.563 12.189 236.233 12.289 236.050 12.491 C 235.873 12.692 235.785 13.071 235.785 13.626 C 235.785 14.740 235.785 15.854 235.785 16.968 C 234.656 16.968 233.526 16.968 232.397 16.968 C 232.397 16.019 232.397 15.070 232.397 14.120 C 232.397 13.394 232.437 12.872 232.516 12.555 C 232.596 12.231 232.776 11.978 233.057 11.795 C 233.343 11.612 233.829 11.429 234.512 11.246 C 233.627 11.166 233.053 10.916 232.791 10.495 C 232.529 10.068 232.397 9.308 232.397 8.215 C 232.397 7.007 232.745 6.140 233.441 5.615 C 234.143 5.084 235.657 4.819 237.982 4.819 C 238.894 4.819 239.807 4.819 240.719 4.819 M 231.015 6.760 C 231.241 7.382 231.354 8.264 231.354 9.405 C 230.191 9.406 229.028 9.406 227.865 9.405 C 227.865 8.939 227.865 8.472 227.865 8.005 C 227.865 7.516 227.826 7.187 227.746 7.016 C 227.667 6.839 227.521 6.750 227.307 6.750 C 227.093 6.750 226.950 6.827 226.877 6.979 C 226.803 7.132 226.767 7.474 226.767 8.005 C 226.767 9.915 226.767 11.826 226.767 13.736 C 226.767 14.169 226.822 14.496 226.932 14.715 C 227.041 14.929 227.203 15.036 227.417 15.036 C 227.667 15.036 227.835 14.923 227.920 14.697 C 228.012 14.471 228.058 14.044 228.058 13.415 C 228.058 12.933 228.058 12.451 228.058 11.969 C 229.156 11.969 230.255 11.969 231.354 11.969 C 231.347 12.939 231.311 13.669 231.244 14.157 C 231.183 14.639 230.978 15.137 230.630 15.649 C 230.289 16.156 229.840 16.540 229.284 16.803 C 228.729 17.059 228.042 17.187 227.225 17.187 C 226.181 17.187 225.354 17.010 224.743 16.656 C 224.133 16.296 223.700 15.796 223.443 15.155 C 223.193 14.508 223.068 13.592 223.068 12.408 C 223.068 11.258 223.068 10.107 223.068 8.957 C 223.068 7.925 223.172 7.147 223.379 6.622 C 223.587 6.097 224.029 5.630 224.707 5.222 C 225.384 4.806 226.208 4.599 227.179 4.599 C 228.143 4.599 228.967 4.803 229.651 5.212 C 230.334 5.621 230.789 6.137 231.015 6.760 M 218.051 14.230 C 218.228 14.102 218.316 13.708 218.316 13.049 C 218.316 12.888 218.316 12.726 218.316 12.564 C 218.316 11.935 218.252 11.554 218.124 11.420 C 218.002 11.285 217.648 11.209 217.062 11.191 C 217.062 12.265 217.062 13.339 217.062 14.413 C 217.550 14.413 217.880 14.352 218.051 14.230 M 221.997 12.262 C 221.997 12.674 221.997 13.086 221.997 13.498 C 221.997 14.609 221.866 15.405 221.603 15.887 C 221.347 16.370 220.941 16.672 220.386 16.794 C 219.830 16.910 218.924 16.968 217.667 16.968 C 216.241 16.968 214.816 16.968 213.391 16.968 C 213.391 12.918 213.391 8.868 213.391 4.819 C 214.615 4.819 215.838 4.819 217.062 4.819 C 217.062 6.168 217.062 7.516 217.062 8.865 C 217.264 8.865 217.465 8.865 217.667 8.865 C 218.844 8.865 219.723 8.936 220.303 9.076 C 220.883 9.216 221.310 9.524 221.585 10.001 C 221.860 10.477 221.997 11.230 221.997 12.262 M 204.721 4.819 C 207.364 4.819 210.007 4.819 212.649 4.819 C 212.649 5.667 212.649 6.516 212.649 7.364 C 211.944 7.364 211.239 7.364 210.534 7.364 C 210.534 10.565 210.534 13.766 210.534 16.968 C 209.305 16.968 208.075 16.968 206.845 16.968 C 206.845 13.766 206.845 10.565 206.845 7.364 C 206.137 7.364 205.429 7.364 204.721 7.364 C 204.721 6.516 204.721 5.667 204.721 4.819 M 200.354 13.690 C 200.354 12.857 200.354 12.024 200.354 11.191 C 199.762 11.624 199.417 11.987 199.319 12.280 C 199.228 12.573 199.182 12.994 199.182 13.544 C 199.182 14.172 199.222 14.578 199.301 14.761 C 199.386 14.944 199.551 15.036 199.795 15.036 C 200.027 15.036 200.177 14.966 200.244 14.825 C 200.317 14.679 200.354 14.300 200.354 13.690 M 199.182 8.252 C 199.182 8.676 199.182 9.100 199.182 9.524 C 198.025 9.524 196.869 9.524 195.712 9.524 C 195.712 9.253 195.712 8.981 195.712 8.710 C 195.712 7.770 195.819 7.046 196.033 6.540 C 196.252 6.027 196.689 5.576 197.342 5.185 C 197.995 4.794 198.843 4.599 199.887 4.599 C 201.138 4.599 202.081 4.822 202.716 5.267 C 203.351 5.707 203.732 6.250 203.860 6.897 C 203.989 7.538 204.053 8.862 204.053 10.870 C 204.053 12.903 204.053 14.935 204.053 16.968 C 202.853 16.968 201.654 16.968 200.455 16.968 C 200.455 16.608 200.455 16.248 200.455 15.887 C 200.229 16.321 199.936 16.647 199.576 16.867 C 199.222 17.081 198.797 17.187 198.303 17.187 C 197.656 17.187 197.061 17.007 196.518 16.647 C 195.981 16.281 195.712 15.485 195.712 14.258 C 195.712 13.925 195.712 13.593 195.712 13.260 C 195.712 12.350 195.856 11.731 196.142 11.401 C 196.429 11.072 197.140 10.687 198.276 10.248 C 199.490 9.772 200.140 9.451 200.226 9.286 C 200.311 9.122 200.354 8.786 200.354 8.279 C 200.354 7.645 200.305 7.233 200.207 7.043 C 200.116 6.848 199.960 6.750 199.740 6.750 C 199.490 6.750 199.335 6.833 199.274 6.998 C 199.212 7.156 199.182 7.574 199.182 8.252 M 194.440 6.760 C 194.665 7.382 194.778 8.264 194.778 9.405 C 193.616 9.406 192.453 9.406 191.290 9.405 C 191.290 8.939 191.290 8.472 191.290 8.005 C 191.290 7.516 191.250 7.187 191.171 7.016 C 191.092 6.839 190.945 6.750 190.732 6.750 C 190.518 6.750 190.375 6.827 190.301 6.979 C 190.228 7.132 190.191 7.474 190.191 8.005 C 190.191 9.915 190.191 11.826 190.191 13.736 C 190.191 14.169 190.246 14.496 190.356 14.715 C 190.466 14.929 190.628 15.036 190.842 15.036 C 191.092 15.036 191.260 14.923 191.345 14.697 C 191.437 14.471 191.482 14.044 191.482 13.415 C 191.482 12.933 191.482 12.451 191.482 11.969 C 192.581 11.969 193.680 11.969 194.778 11.969 C 194.772 12.939 194.735 13.669 194.668 14.157 C 194.607 14.639 194.403 15.137 194.055 15.649 C 193.713 16.156 193.265 16.540 192.709 16.803 C 192.154 17.059 191.467 17.187 190.649 17.187 C 189.606 17.187 188.779 17.010 188.168 16.656 C 187.558 16.296 187.125 15.796 186.868 15.155 C 186.618 14.508 186.493 13.592 186.493 12.408 C 186.493 11.258 186.493 10.107 186.493 8.957 C 186.493 7.925 186.596 7.147 186.804 6.622 C 187.012 6.097 187.454 5.630 188.132 5.222 C 188.809 4.806 189.633 4.599 190.604 4.599 C 191.568 4.599 192.392 4.803 193.075 5.212 C 193.759 5.621 194.214 6.137 194.440 6.760 M 185.284 4.819 C 185.284 8.868 185.284 12.918 185.284 16.968 C 184.210 16.968 183.136 16.968 182.062 16.968 C 182.062 14.780 182.062 12.592 182.062 10.403 C 181.204 12.592 180.346 14.780 179.489 16.968 C 178.366 16.968 177.243 16.968 176.120 16.968 C 176.120 12.918 176.120 8.868 176.120 4.819 C 177.194 4.819 178.268 4.819 179.343 4.819 C 179.342 6.988 179.342 9.158 179.343 11.328 C 180.185 9.158 181.027 6.988 181.869 4.819 C 183.008 4.819 184.146 4.819 185.284 4.819 M 169.812 16.968 C 168.588 16.968 167.364 16.968 166.141 16.968 C 166.141 12.918 166.141 8.868 166.141 4.819 C 169.028 4.819 171.914 4.819 174.801 4.819 C 174.801 8.868 174.801 12.918 174.801 16.968 C 173.575 16.968 172.348 16.968 171.121 16.968 C 171.121 13.766 171.121 10.565 171.121 7.364 C 170.685 7.364 170.248 7.364 169.812 7.364 C 169.812 10.565 169.812 13.766 169.812 16.968 M 161.169 13.690 C 161.169 12.857 161.169 12.024 161.169 11.191 C 160.577 11.624 160.232 11.987 160.135 12.280 C 160.043 12.573 159.997 12.994 159.997 13.544 C 159.997 14.172 160.037 14.578 160.116 14.761 C 160.202 14.944 160.367 15.036 160.611 15.036 C 160.843 15.036 160.992 14.966 161.059 14.825 C 161.133 14.679 161.169 14.300 161.169 13.690 M 159.997 8.252 C 159.997 8.676 159.997 9.100 159.997 9.524 C 158.841 9.524 157.684 9.524 156.528 9.524 C 156.528 9.253 156.528 8.981 156.528 8.710 C 156.528 7.770 156.634 7.046 156.848 6.540 C 157.068 6.027 157.504 5.576 158.157 5.185 C 158.810 4.794 159.659 4.599 160.702 4.599 C 161.954 4.599 162.897 4.822 163.531 5.267 C 164.166 5.707 164.548 6.250 164.676 6.897 C 164.804 7.538 164.868 8.862 164.868 10.870 C 164.868 12.903 164.868 14.935 164.868 16.968 C 163.669 16.968 162.469 16.968 161.270 16.968 C 161.270 16.608 161.270 16.248 161.270 15.887 C 161.044 16.321 160.751 16.647 160.391 16.867 C 160.037 17.081 159.613 17.187 159.118 17.187 C 158.472 17.187 157.876 17.007 157.333 16.647 C 156.796 16.281 156.528 15.485 156.528 14.258 C 156.528 13.925 156.528 13.593 156.528 13.260 C 156.528 12.350 156.671 11.731 156.958 11.401 C 157.245 11.072 157.956 10.687 159.091 10.248 C 160.306 9.772 160.956 9.451 161.041 9.286 C 161.126 9.122 161.169 8.786 161.169 8.279 C 161.169 7.645 161.120 7.233 161.023 7.043 C 160.931 6.848 160.776 6.750 160.556 6.750 C 160.306 6.750 160.150 6.833 160.089 6.998 C 160.028 7.156 159.997 7.574 159.997 8.252 M 154.889 7.565 C 154.663 7.931 154.266 8.267 153.699 8.572 C 154.260 8.762 154.678 9.073 154.953 9.506 C 155.228 9.933 155.365 10.940 155.365 12.527 C 155.365 13.705 155.231 14.621 154.962 15.274 C 154.693 15.921 154.230 16.415 153.570 16.757 C 152.911 17.093 152.066 17.261 151.034 17.261 C 149.862 17.261 148.941 17.065 148.269 16.675 C 147.604 16.278 147.165 15.796 146.951 15.228 C 146.744 14.654 146.640 13.663 146.640 12.253 C 146.640 11.862 146.640 11.472 146.640 11.081 C 147.873 11.081 149.106 11.081 150.339 11.081 C 150.339 11.883 150.338 12.686 150.339 13.489 C 150.339 14.130 150.375 14.538 150.449 14.715 C 150.528 14.886 150.699 14.972 150.961 14.972 C 151.248 14.972 151.437 14.862 151.529 14.642 C 151.620 14.423 151.666 13.849 151.666 12.921 C 151.666 12.579 151.666 12.237 151.666 11.896 C 151.666 11.328 151.602 10.913 151.474 10.651 C 151.346 10.388 151.156 10.217 150.906 10.138 C 150.656 10.052 150.171 10.004 149.451 9.991 C 149.451 9.274 149.451 8.557 149.451 7.840 C 150.329 7.840 150.873 7.806 151.080 7.739 C 151.288 7.672 151.437 7.526 151.529 7.300 C 151.620 7.074 151.666 6.720 151.666 6.238 C 151.666 5.963 151.666 5.689 151.666 5.414 C 151.666 4.895 151.611 4.553 151.501 4.388 C 151.398 4.224 151.233 4.141 151.007 4.141 C 150.751 4.141 150.574 4.230 150.476 4.407 C 150.384 4.578 150.339 4.947 150.339 5.514 C 150.339 5.920 150.339 6.326 150.339 6.732 C 149.106 6.732 147.873 6.732 146.640 6.732 C 146.640 6.311 146.640 5.890 146.640 5.469 C 146.640 4.053 146.963 3.097 147.610 2.603 C 148.257 2.103 149.286 1.852 150.696 1.852 C 152.460 1.852 153.656 2.197 154.284 2.887 C 154.913 3.577 155.227 4.535 155.227 5.762 C 155.228 6.592 155.115 7.193 154.889 7.565 Z"
            />
          </motion.g>
          <motion.g initial={{ opacity: 0 }} id="text4">
            <path
              id="S1"
              fill="#25657f"
              fillRule="evenodd"
              stroke="none"
              d="M 341.116 7.045 C 341.341 7.668 341.454 8.550 341.454 9.691 C 340.292 9.691 339.129 9.691 337.966 9.691 C 337.966 9.224 337.966 8.757 337.966 8.290 C 337.966 7.802 337.926 7.472 337.847 7.302 C 337.768 7.125 337.621 7.036 337.408 7.036 C 337.194 7.036 337.051 7.112 336.977 7.265 C 336.904 7.418 336.867 7.759 336.867 8.290 C 336.867 10.201 336.867 12.111 336.867 14.022 C 336.867 14.455 336.922 14.781 337.032 15.001 C 337.142 15.215 337.304 15.322 337.518 15.322 C 337.768 15.322 337.936 15.209 338.021 14.983 C 338.113 14.757 338.158 14.330 338.158 13.701 C 338.158 13.219 338.158 12.737 338.158 12.255 C 339.257 12.255 340.356 12.255 341.454 12.255 C 341.448 13.225 341.412 13.954 341.345 14.443 C 341.283 14.925 341.079 15.422 340.731 15.935 C 340.389 16.442 339.941 16.826 339.385 17.088 C 338.830 17.345 338.143 17.473 337.325 17.473 C 336.282 17.473 335.455 17.296 334.844 16.942 C 334.234 16.582 333.801 16.081 333.544 15.441 C 333.294 14.794 333.169 13.878 333.169 12.694 C 333.169 11.544 333.169 10.393 333.169 9.242 C 333.169 8.211 333.272 7.433 333.480 6.908 C 333.688 6.383 334.130 5.916 334.808 5.507 C 335.485 5.092 336.309 4.885 337.280 4.885 C 338.244 4.885 339.068 5.089 339.751 5.498 C 340.435 5.907 340.890 6.423 341.116 7.045 M 328.362 13.848 C 328.362 12.111 328.362 10.375 328.362 8.638 C 328.362 7.887 328.335 7.433 328.280 7.274 C 328.225 7.115 328.072 7.036 327.822 7.036 C 327.578 7.036 327.419 7.128 327.346 7.311 C 327.279 7.494 327.245 7.936 327.245 8.638 C 327.245 10.317 327.245 11.995 327.245 13.674 C 327.245 14.406 327.282 14.864 327.355 15.047 C 327.428 15.230 327.587 15.322 327.831 15.322 C 328.069 15.322 328.216 15.239 328.271 15.074 C 328.332 14.903 328.362 14.495 328.362 13.848 M 323.547 5.104 C 324.801 5.104 326.055 5.104 327.309 5.104 C 327.288 5.461 327.267 5.819 327.245 6.175 C 327.575 5.742 327.938 5.419 328.335 5.205 C 328.732 4.991 329.165 4.885 329.635 4.885 C 330.209 4.885 330.703 5.040 331.118 5.351 C 331.539 5.657 331.802 6.011 331.905 6.413 C 332.009 6.816 332.061 7.500 332.061 8.464 C 332.061 10.170 332.061 11.876 332.061 13.582 C 332.061 14.687 331.994 15.474 331.860 15.944 C 331.731 16.408 331.463 16.780 331.054 17.061 C 330.651 17.336 330.163 17.473 329.589 17.473 C 329.131 17.473 328.707 17.366 328.317 17.153 C 327.926 16.939 327.569 16.622 327.245 16.200 C 327.245 17.128 327.245 18.056 327.245 18.984 C 326.012 18.984 324.779 18.984 323.547 18.984 C 323.547 14.357 323.547 9.731 323.547 5.104 M 319.527 5.104 C 320.647 5.104 321.767 5.104 322.887 5.104 C 322.533 8.034 322.179 10.964 321.825 13.893 C 321.661 15.285 321.520 16.234 321.404 16.741 C 321.294 17.247 321.108 17.665 320.846 17.995 C 320.583 18.324 320.217 18.566 319.747 18.718 C 319.283 18.877 318.539 18.956 317.513 18.956 C 316.766 18.956 316.018 18.956 315.270 18.956 C 315.270 18.309 315.270 17.662 315.270 17.015 C 315.844 17.015 316.213 16.988 316.378 16.933 C 316.543 16.872 316.625 16.741 316.625 16.539 C 316.625 16.441 316.549 16.017 316.396 15.267 C 315.722 11.879 315.047 8.492 314.373 5.104 C 315.493 5.104 316.613 5.104 317.733 5.104 C 318.136 7.836 318.539 10.567 318.942 13.298 C 319.137 10.567 319.332 7.836 319.527 5.104 M 305.556 5.104 C 306.774 5.104 307.992 5.104 309.209 5.104 C 309.209 6.679 309.209 8.254 309.209 9.828 C 309.985 9.828 310.372 9.416 310.372 8.592 C 310.372 7.906 310.372 7.219 310.372 6.533 C 310.372 5.702 310.509 5.226 310.784 5.104 C 311.971 5.104 313.158 5.104 314.346 5.104 C 314.071 5.501 313.934 6.087 313.934 6.862 C 313.933 7.427 313.933 7.991 313.934 8.556 C 313.934 9.148 313.692 9.639 313.210 10.030 C 313.033 10.176 312.661 10.384 312.093 10.652 C 311.727 10.829 311.315 10.924 310.857 10.936 C 311.071 10.973 311.471 11.074 312.057 11.238 C 313.320 11.641 313.952 12.346 313.952 13.353 C 313.952 14.064 313.952 14.775 313.952 15.486 C 313.952 16.268 314.089 16.857 314.364 17.253 C 313.177 17.253 311.989 17.253 310.802 17.253 C 310.528 16.881 310.391 16.405 310.391 15.825 C 310.390 14.971 310.390 14.116 310.391 13.262 C 310.391 12.438 309.997 12.026 309.209 12.026 C 309.209 13.768 309.209 15.511 309.209 17.253 C 307.992 17.253 306.774 17.253 305.556 17.253 C 305.556 13.204 305.556 9.154 305.556 5.104 M 296.328 2.779 C 296.951 2.779 297.298 2.361 297.372 1.525 C 297.890 1.525 298.409 1.525 298.928 1.525 C 298.891 2.355 298.647 3.023 298.196 3.530 C 297.750 4.036 297.128 4.289 296.328 4.289 C 295.522 4.289 294.897 4.036 294.451 3.530 C 294.012 3.017 293.774 2.349 293.737 1.525 C 294.256 1.525 294.775 1.525 295.293 1.525 C 295.367 2.361 295.712 2.779 296.328 2.779 M 300.933 5.104 C 300.933 9.154 300.933 13.204 300.933 17.253 C 299.859 17.253 298.785 17.253 297.710 17.253 C 297.710 15.065 297.710 12.877 297.710 10.689 C 296.853 12.877 295.995 15.065 295.138 17.253 C 294.015 17.253 292.892 17.253 291.769 17.253 C 291.769 13.204 291.769 9.154 291.769 5.104 C 292.843 5.104 293.917 5.104 294.991 5.104 C 294.991 7.274 294.991 9.444 294.991 11.614 C 295.834 9.444 296.676 7.274 297.518 5.104 C 298.656 5.104 299.795 5.104 300.933 5.104 M 290.469 5.104 C 290.468 9.154 290.468 13.204 290.469 17.253 C 289.245 17.253 288.021 17.253 286.797 17.253 C 286.797 13.204 286.797 9.154 286.797 5.104 C 288.021 5.104 289.245 5.104 290.469 5.104 M 281.725 14.516 C 281.902 14.388 281.991 13.994 281.991 13.335 C 281.991 13.173 281.991 13.011 281.991 12.850 C 281.991 12.221 281.927 11.840 281.799 11.705 C 281.676 11.571 281.322 11.495 280.737 11.476 C 280.737 12.551 280.737 13.625 280.737 14.699 C 281.225 14.699 281.554 14.638 281.725 14.516 M 285.671 12.548 C 285.671 12.960 285.671 13.372 285.671 13.783 C 285.671 14.894 285.540 15.691 285.278 16.173 C 285.021 16.655 284.615 16.957 284.060 17.079 C 283.505 17.195 282.598 17.253 281.341 17.253 C 279.916 17.253 278.490 17.253 277.065 17.253 C 277.065 13.204 277.065 9.154 277.065 5.104 C 278.289 5.104 279.513 5.104 280.737 5.104 C 280.737 6.453 280.737 7.802 280.737 9.151 C 280.938 9.151 281.139 9.151 281.341 9.151 C 282.519 9.151 283.398 9.221 283.977 9.361 C 284.557 9.502 284.985 9.810 285.259 10.286 C 285.534 10.762 285.671 11.516 285.671 12.548 M 275.747 5.104 C 275.747 9.154 275.747 13.204 275.747 17.253 C 274.520 17.253 273.293 17.253 272.067 17.253 C 272.066 15.761 272.066 14.269 272.067 12.776 C 271.624 12.776 271.181 12.776 270.739 12.776 C 270.739 14.269 270.739 15.761 270.739 17.253 C 269.515 17.253 268.291 17.253 267.068 17.253 C 267.068 13.204 267.068 9.154 267.068 5.104 C 268.291 5.104 269.515 5.104 270.739 5.104 C 270.739 6.560 270.739 8.016 270.739 9.471 C 271.182 9.471 271.624 9.471 272.067 9.471 C 272.066 8.016 272.066 6.560 272.067 5.104 C 273.293 5.104 274.520 5.104 275.747 5.104 M 265.749 5.104 C 265.749 9.154 265.749 13.204 265.749 17.253 C 264.522 17.253 263.296 17.253 262.069 17.253 C 262.069 15.761 262.069 14.269 262.069 12.776 C 261.626 12.776 261.184 12.776 260.741 12.776 C 260.741 14.269 260.741 15.761 260.741 17.253 C 259.518 17.253 258.294 17.253 257.070 17.253 C 257.070 13.204 257.070 9.154 257.070 5.104 C 258.294 5.104 259.518 5.104 260.741 5.104 C 260.741 6.560 260.741 8.016 260.741 9.471 C 261.184 9.471 261.626 9.471 262.069 9.471 C 262.069 8.016 262.069 6.560 262.069 5.104 C 263.296 5.104 264.522 5.104 265.749 5.104 M 252.099 13.976 C 252.099 13.143 252.099 12.310 252.099 11.476 C 251.507 11.910 251.162 12.273 251.064 12.566 C 250.973 12.859 250.927 13.280 250.927 13.829 C 250.927 14.458 250.967 14.864 251.046 15.047 C 251.131 15.230 251.296 15.322 251.540 15.322 C 251.772 15.322 251.922 15.251 251.989 15.111 C 252.062 14.965 252.099 14.586 252.099 13.976 M 250.927 8.538 C 250.927 8.962 250.927 9.386 250.927 9.810 C 249.770 9.810 248.614 9.810 247.457 9.810 C 247.457 9.539 247.457 9.267 247.457 8.995 C 247.457 8.055 247.564 7.332 247.777 6.825 C 247.997 6.313 248.434 5.861 249.087 5.471 C 249.740 5.080 250.588 4.885 251.632 4.885 C 252.883 4.885 253.826 5.107 254.461 5.553 C 255.096 5.992 255.477 6.535 255.605 7.182 C 255.733 7.823 255.798 9.148 255.798 11.156 C 255.797 13.188 255.797 15.221 255.798 17.253 C 254.598 17.253 253.399 17.253 252.200 17.253 C 252.199 16.893 252.199 16.533 252.200 16.173 C 251.974 16.606 251.681 16.933 251.321 17.153 C 250.967 17.366 250.542 17.473 250.048 17.473 C 249.401 17.473 248.806 17.293 248.263 16.933 C 247.726 16.567 247.457 15.770 247.457 14.543 C 247.457 14.211 247.457 13.878 247.457 13.545 C 247.457 12.636 247.601 12.017 247.887 11.687 C 248.174 11.357 248.885 10.973 250.021 10.533 C 251.235 10.057 251.885 9.737 251.971 9.572 C 252.056 9.407 252.099 9.072 252.099 8.565 C 252.099 7.930 252.050 7.518 251.952 7.329 C 251.861 7.134 251.705 7.036 251.485 7.036 C 251.235 7.036 251.080 7.118 251.019 7.283 C 250.958 7.442 250.927 7.860 250.927 8.538 M 242.632 14.488 C 242.791 14.342 242.870 14.006 242.870 13.481 C 242.870 13.344 242.870 13.207 242.870 13.069 C 242.870 12.544 242.800 12.218 242.660 12.090 C 242.519 11.955 242.184 11.888 241.653 11.888 C 241.653 12.825 241.653 13.762 241.653 14.699 C 242.147 14.699 242.474 14.629 242.632 14.488 M 241.653 7.649 C 241.653 8.306 241.653 8.962 241.653 9.618 C 242.214 9.618 242.556 9.548 242.678 9.407 C 242.806 9.267 242.870 8.989 242.870 8.574 C 242.870 8.226 242.800 7.985 242.660 7.851 C 242.519 7.717 242.184 7.649 241.653 7.649 M 246.551 13.335 C 246.551 13.573 246.551 13.811 246.551 14.049 C 246.551 15.288 246.279 16.133 245.736 16.585 C 245.199 17.031 244.027 17.253 242.220 17.253 C 240.807 17.253 239.394 17.253 237.981 17.253 C 237.981 13.204 237.981 9.154 237.981 5.104 C 239.437 5.104 240.893 5.104 242.349 5.104 C 243.844 5.104 244.872 5.351 245.434 5.846 C 246.001 6.340 246.285 7.186 246.285 8.382 C 246.285 9.755 245.571 10.536 244.143 10.726 C 244.887 10.848 245.473 11.141 245.901 11.604 C 246.334 12.062 246.551 12.639 246.551 13.335 M 233.065 14.058 C 233.065 12.191 233.065 10.323 233.065 8.455 C 233.065 7.833 233.031 7.442 232.964 7.283 C 232.897 7.118 232.754 7.036 232.534 7.036 C 232.314 7.036 232.168 7.118 232.095 7.283 C 232.021 7.442 231.985 7.833 231.985 8.455 C 231.985 10.283 231.985 12.111 231.985 13.939 C 231.985 14.513 232.021 14.888 232.095 15.065 C 232.168 15.236 232.311 15.322 232.525 15.322 C 232.745 15.322 232.888 15.242 232.955 15.084 C 233.028 14.925 233.065 14.583 233.065 14.058 M 236.581 7.448 C 236.703 7.869 236.764 8.510 236.764 9.371 C 236.764 10.363 236.764 11.354 236.764 12.346 C 236.764 13.439 236.709 14.241 236.599 14.754 C 236.489 15.261 236.254 15.737 235.894 16.182 C 235.534 16.622 235.070 16.948 234.502 17.162 C 233.941 17.369 233.294 17.473 232.562 17.473 C 231.744 17.473 231.051 17.385 230.483 17.208 C 229.916 17.024 229.473 16.753 229.156 16.393 C 228.844 16.027 228.622 15.587 228.487 15.074 C 228.353 14.556 228.286 13.780 228.286 12.749 C 228.286 11.711 228.286 10.674 228.286 9.636 C 228.286 8.507 228.408 7.625 228.652 6.990 C 228.896 6.356 229.336 5.846 229.971 5.461 C 230.605 5.077 231.417 4.885 232.406 4.885 C 233.236 4.885 233.947 5.010 234.539 5.260 C 235.137 5.504 235.598 5.825 235.921 6.221 C 236.245 6.618 236.465 7.027 236.581 7.448 M 220.953 14.333 C 221.639 14.333 222.326 14.333 223.013 14.333 C 223.012 12.169 223.012 10.005 223.013 7.842 C 222.692 7.842 222.372 7.842 222.051 7.842 C 222.051 10.228 221.685 12.349 220.953 14.333 M 222.051 7.842 C 222.051 7.885 222.051 7.927 222.051 7.970 M 227.471 14.333 C 227.471 16.088 227.471 17.842 227.471 19.597 C 226.647 19.597 225.823 19.597 224.999 19.597 C 224.999 18.816 224.999 18.035 224.999 17.253 C 222.924 17.253 220.849 17.253 218.774 17.253 C 218.774 18.035 218.774 18.816 218.774 19.597 C 217.950 19.597 217.126 19.597 216.302 19.597 C 216.302 17.848 216.302 16.100 216.302 14.351 C 216.564 14.351 216.827 14.351 217.089 14.351 C 217.559 13.625 217.944 12.499 218.243 10.973 C 218.548 9.441 218.700 7.634 218.700 5.553 C 218.700 5.403 218.700 5.254 218.700 5.104 C 221.362 5.104 224.023 5.104 226.684 5.104 C 226.684 8.180 226.684 11.257 226.684 14.333 C 226.946 14.333 227.209 14.333 227.471 14.333 M 215.395 5.104 C 215.395 9.154 215.395 13.204 215.395 17.253 C 214.168 17.253 212.942 17.253 211.715 17.253 C 211.715 15.761 211.715 14.269 211.715 12.776 C 211.272 12.776 210.830 12.776 210.387 12.776 C 210.387 14.269 210.387 15.761 210.387 17.253 C 209.164 17.253 207.940 17.253 206.716 17.253 C 206.716 13.204 206.716 9.154 206.716 5.104 C 207.940 5.104 209.164 5.104 210.387 5.104 C 210.387 6.560 210.387 8.016 210.387 9.471 C 210.830 9.471 211.272 9.471 211.715 9.471 C 211.715 8.016 211.715 6.560 211.715 5.104 C 212.942 5.104 214.168 5.104 215.395 5.104 M 200.720 9.416 C 201.080 9.416 201.440 9.416 201.800 9.416 C 201.800 9.120 201.800 8.824 201.800 8.528 C 201.800 7.900 201.766 7.494 201.699 7.311 C 201.632 7.128 201.495 7.036 201.287 7.036 C 201.031 7.036 200.872 7.115 200.811 7.274 C 200.750 7.427 200.719 7.845 200.720 8.528 C 200.719 8.824 200.719 9.120 200.720 9.416 M 205.508 9.783 C 205.508 10.320 205.508 10.857 205.508 11.394 C 203.912 11.394 202.315 11.394 200.720 11.394 C 200.719 12.270 200.719 13.146 200.720 14.022 C 200.719 14.571 200.759 14.925 200.838 15.084 C 200.918 15.242 201.070 15.322 201.296 15.322 C 201.577 15.322 201.763 15.218 201.855 15.010 C 201.952 14.797 202.001 14.388 202.001 13.783 C 202.001 13.249 202.001 12.715 202.001 12.181 C 203.170 12.181 204.339 12.181 205.508 12.181 C 205.508 12.480 205.508 12.779 205.508 13.079 C 205.508 13.829 205.459 14.406 205.361 14.809 C 205.270 15.212 205.050 15.642 204.702 16.100 C 204.354 16.558 203.912 16.902 203.374 17.134 C 202.843 17.360 202.175 17.473 201.369 17.473 C 200.588 17.473 199.898 17.360 199.300 17.134 C 198.702 16.909 198.235 16.600 197.900 16.210 C 197.570 15.813 197.341 15.380 197.213 14.910 C 197.085 14.433 197.021 13.744 197.021 12.840 C 197.021 11.660 197.021 10.479 197.021 9.297 C 197.021 8.235 197.164 7.399 197.451 6.789 C 197.738 6.172 198.208 5.702 198.861 5.379 C 199.514 5.049 200.265 4.885 201.113 4.885 C 202.151 4.885 203.005 5.083 203.677 5.480 C 204.354 5.870 204.827 6.392 205.096 7.045 C 205.370 7.692 205.508 8.605 205.508 9.783 M 195.812 5.104 C 195.812 9.154 195.812 13.204 195.812 17.253 C 194.756 17.253 193.700 17.253 192.645 17.253 C 192.644 14.461 192.644 11.669 192.645 8.876 C 192.132 11.669 191.619 14.461 191.106 17.253 C 190.432 17.253 189.757 17.253 189.083 17.253 C 188.552 14.461 188.021 11.669 187.490 8.876 C 187.490 11.669 187.490 14.461 187.490 17.253 C 186.434 17.253 185.378 17.253 184.322 17.253 C 184.322 13.204 184.322 9.154 184.322 5.104 C 185.851 5.104 187.380 5.104 188.909 5.104 C 189.303 7.341 189.696 9.578 190.090 11.815 C 190.447 9.578 190.804 7.341 191.161 5.104 C 192.712 5.104 194.262 5.104 195.812 5.104 M 179.406 14.058 C 179.406 12.191 179.406 10.323 179.406 8.455 C 179.406 7.833 179.372 7.442 179.305 7.283 C 179.238 7.118 179.095 7.036 178.875 7.036 C 178.655 7.036 178.509 7.118 178.436 7.283 C 178.362 7.442 178.326 7.833 178.326 8.455 C 178.326 10.283 178.326 12.111 178.326 13.939 C 178.326 14.513 178.362 14.888 178.436 15.065 C 178.509 15.236 178.652 15.322 178.866 15.322 C 179.086 15.322 179.229 15.242 179.296 15.084 C 179.369 14.925 179.406 14.583 179.406 14.058 M 182.922 7.448 C 183.044 7.869 183.105 8.510 183.105 9.371 C 183.105 10.363 183.105 11.354 183.105 12.346 C 183.105 13.439 183.050 14.241 182.940 14.754 C 182.830 15.261 182.595 15.737 182.235 16.182 C 181.875 16.622 181.411 16.948 180.843 17.162 C 180.282 17.369 179.635 17.473 178.902 17.473 C 178.085 17.473 177.392 17.385 176.824 17.208 C 176.257 17.024 175.814 16.753 175.497 16.393 C 175.185 16.027 174.963 15.587 174.828 15.074 C 174.694 14.556 174.627 13.780 174.627 12.749 C 174.627 11.711 174.627 10.674 174.627 9.636 C 174.627 8.507 174.749 7.625 174.993 6.990 C 175.237 6.356 175.677 5.846 176.312 5.461 C 176.946 5.077 177.758 4.885 178.747 4.885 C 179.577 4.885 180.288 5.010 180.880 5.260 C 181.478 5.504 181.939 5.825 182.262 6.221 C 182.586 6.618 182.806 7.027 182.922 7.448 M 165.151 5.104 C 166.369 5.104 167.586 5.104 168.804 5.104 C 168.804 6.679 168.804 8.254 168.804 9.828 C 169.579 9.828 169.967 9.416 169.967 8.592 C 169.967 7.906 169.967 7.219 169.967 6.533 C 169.967 5.702 170.104 5.226 170.379 5.104 C 171.566 5.104 172.753 5.104 173.940 5.104 C 173.666 5.501 173.528 6.087 173.528 6.862 C 173.528 7.427 173.528 7.991 173.528 8.556 C 173.528 9.148 173.287 9.639 172.805 10.030 C 172.628 10.176 172.256 10.384 171.688 10.652 C 171.322 10.829 170.910 10.924 170.452 10.936 C 170.666 10.973 171.065 11.074 171.651 11.238 C 172.915 11.641 173.547 12.346 173.547 13.353 C 173.546 14.064 173.546 14.775 173.547 15.486 C 173.547 16.268 173.684 16.857 173.959 17.253 C 172.771 17.253 171.584 17.253 170.397 17.253 C 170.123 16.881 169.985 16.405 169.985 15.825 C 169.985 14.971 169.985 14.116 169.985 13.262 C 169.985 12.438 169.592 12.026 168.804 12.026 C 168.804 13.768 168.804 15.511 168.804 17.253 C 167.586 17.253 166.369 17.253 165.151 17.253 C 165.151 13.204 165.151 9.154 165.151 5.104 M 159.154 9.416 C 159.515 9.416 159.875 9.416 160.235 9.416 C 160.235 9.120 160.235 8.824 160.235 8.528 C 160.235 7.900 160.201 7.494 160.134 7.311 C 160.067 7.128 159.930 7.036 159.722 7.036 C 159.466 7.036 159.307 7.115 159.246 7.274 C 159.185 7.427 159.154 7.845 159.154 8.528 C 159.154 8.824 159.154 9.120 159.154 9.416 M 163.943 9.783 C 163.943 10.320 163.943 10.857 163.943 11.394 C 162.347 11.394 160.751 11.394 159.154 11.394 C 159.154 12.270 159.154 13.146 159.154 14.022 C 159.155 14.571 159.194 14.925 159.274 15.084 C 159.353 15.242 159.505 15.322 159.731 15.322 C 160.012 15.322 160.198 15.218 160.290 15.010 C 160.387 14.797 160.436 14.388 160.436 13.783 C 160.436 13.249 160.436 12.715 160.436 12.181 C 161.605 12.181 162.774 12.181 163.943 12.181 C 163.943 12.480 163.943 12.779 163.943 13.079 C 163.943 13.829 163.894 14.406 163.796 14.809 C 163.705 15.212 163.485 15.642 163.137 16.100 C 162.789 16.558 162.347 16.902 161.810 17.134 C 161.279 17.360 160.610 17.473 159.805 17.473 C 159.023 17.473 158.334 17.360 157.735 17.134 C 157.137 16.909 156.670 16.600 156.335 16.210 C 156.005 15.813 155.776 15.380 155.648 14.910 C 155.520 14.433 155.456 13.744 155.456 12.840 C 155.456 11.660 155.456 10.479 155.456 9.297 C 155.456 8.235 155.599 7.399 155.886 6.789 C 156.173 6.172 156.643 5.702 157.296 5.379 C 157.949 5.049 158.700 4.885 159.548 4.885 C 160.586 4.885 161.440 5.083 162.112 5.480 C 162.789 5.870 163.262 6.392 163.531 7.045 C 163.805 7.692 163.943 8.605 163.943 9.783 M 150.649 13.848 C 150.649 12.111 150.649 10.375 150.649 8.638 C 150.649 7.887 150.622 7.433 150.567 7.274 C 150.512 7.115 150.359 7.036 150.109 7.036 C 149.865 7.036 149.706 7.128 149.633 7.311 C 149.566 7.494 149.532 7.936 149.532 8.638 C 149.532 10.317 149.532 11.995 149.532 13.674 C 149.532 14.406 149.569 14.864 149.642 15.047 C 149.715 15.230 149.874 15.322 150.118 15.322 C 150.356 15.322 150.503 15.239 150.558 15.074 C 150.619 14.903 150.649 14.495 150.649 13.848 M 145.834 5.104 C 147.088 5.104 148.342 5.104 149.596 5.104 C 149.575 5.461 149.554 5.819 149.532 6.175 C 149.862 5.742 150.225 5.419 150.622 5.205 C 151.018 4.991 151.452 4.885 151.922 4.885 C 152.496 4.885 152.990 5.040 153.405 5.351 C 153.826 5.657 154.089 6.011 154.192 6.413 C 154.296 6.816 154.348 7.500 154.348 8.464 C 154.348 10.170 154.348 11.876 154.348 13.582 C 154.348 14.687 154.281 15.474 154.147 15.944 C 154.018 16.408 153.750 16.780 153.341 17.061 C 152.938 17.336 152.450 17.473 151.876 17.473 C 151.418 17.473 150.994 17.366 150.603 17.153 C 150.213 16.939 149.856 16.622 149.532 16.200 C 149.532 17.128 149.532 18.056 149.532 18.984 C 148.299 18.984 147.066 18.984 145.834 18.984 C 145.834 14.357 145.834 9.731 145.834 5.104 M 141.210 5.104 C 141.210 9.154 141.210 13.204 141.210 17.253 C 140.136 17.253 139.062 17.253 137.988 17.253 C 137.987 15.065 137.987 12.877 137.988 10.689 C 137.130 12.877 136.272 15.065 135.415 17.253 C 134.292 17.253 133.169 17.253 132.046 17.253 C 132.046 13.204 132.046 9.154 132.046 5.104 C 133.120 5.104 134.194 5.104 135.268 5.104 C 135.268 7.274 135.268 9.444 135.268 11.614 C 136.111 9.444 136.953 7.274 137.795 5.104 C 138.933 5.104 140.072 5.104 141.210 5.104 M 123.376 5.104 C 126.019 5.104 128.661 5.104 131.304 5.104 C 131.304 5.953 131.304 6.801 131.304 7.649 C 130.599 7.650 129.894 7.650 129.189 7.649 C 129.189 10.851 129.189 14.052 129.189 17.253 C 127.959 17.253 126.730 17.253 125.500 17.253 C 125.500 14.052 125.500 10.851 125.500 7.649 C 124.792 7.650 124.084 7.650 123.376 7.649 C 123.376 6.801 123.376 5.953 123.376 5.104 M 118.056 2.779 C 118.679 2.779 119.027 2.361 119.100 1.525 C 119.619 1.525 120.138 1.525 120.657 1.525 C 120.620 2.355 120.376 3.023 119.924 3.530 C 119.479 4.036 118.856 4.289 118.056 4.289 C 117.251 4.289 116.625 4.036 116.180 3.530 C 115.740 3.017 115.502 2.349 115.466 1.525 C 115.984 1.525 116.503 1.525 117.022 1.525 C 117.095 2.361 117.440 2.779 118.056 2.779 M 122.662 5.104 C 122.662 9.154 122.662 13.204 122.662 17.253 C 121.587 17.253 120.513 17.253 119.439 17.253 C 119.439 15.065 119.439 12.877 119.439 10.689 C 118.581 12.877 117.724 15.065 116.866 17.253 C 115.743 17.253 114.620 17.253 113.497 17.253 C 113.497 13.204 113.497 9.154 113.497 5.104 C 114.571 5.104 115.646 5.104 116.720 5.104 C 116.720 7.274 116.720 9.444 116.720 11.614 C 117.562 9.444 118.404 7.274 119.247 5.104 C 120.385 5.104 121.523 5.104 122.662 5.104 M 108.581 14.058 C 108.581 12.191 108.581 10.323 108.581 8.455 C 108.581 7.833 108.547 7.442 108.480 7.283 C 108.413 7.118 108.269 7.036 108.050 7.036 C 107.830 7.036 107.684 7.118 107.610 7.283 C 107.537 7.442 107.500 7.833 107.501 8.455 C 107.501 10.283 107.501 12.111 107.501 13.939 C 107.500 14.513 107.537 14.888 107.610 15.065 C 107.684 15.236 107.827 15.322 108.041 15.322 C 108.260 15.322 108.404 15.242 108.471 15.084 C 108.544 14.925 108.581 14.583 108.581 14.058 M 112.096 7.448 C 112.218 7.869 112.279 8.510 112.280 9.371 C 112.279 10.363 112.279 11.354 112.280 12.346 C 112.279 13.439 112.225 14.241 112.115 14.754 C 112.005 15.261 111.770 15.737 111.410 16.182 C 111.050 16.622 110.586 16.948 110.018 17.162 C 109.457 17.369 108.810 17.473 108.077 17.473 C 107.259 17.473 106.567 17.385 105.999 17.208 C 105.431 17.024 104.989 16.753 104.672 16.393 C 104.360 16.027 104.137 15.587 104.003 15.074 C 103.869 14.556 103.802 13.780 103.802 12.749 C 103.802 11.711 103.802 10.674 103.802 9.636 C 103.802 8.507 103.924 7.625 104.168 6.990 C 104.412 6.356 104.852 5.846 105.486 5.461 C 106.121 5.077 106.933 4.885 107.922 4.885 C 108.752 4.885 109.463 5.010 110.055 5.260 C 110.653 5.504 111.114 5.825 111.437 6.221 C 111.761 6.618 111.980 7.027 112.096 7.448 M 98.995 13.848 C 98.995 12.111 98.995 10.375 98.995 8.638 C 98.995 7.887 98.968 7.433 98.913 7.274 C 98.858 7.115 98.705 7.036 98.455 7.036 C 98.211 7.036 98.052 7.128 97.979 7.311 C 97.912 7.494 97.878 7.936 97.878 8.638 C 97.878 10.317 97.878 11.995 97.878 13.674 C 97.878 14.406 97.915 14.864 97.988 15.047 C 98.061 15.230 98.220 15.322 98.464 15.322 C 98.702 15.322 98.849 15.239 98.904 15.074 C 98.965 14.903 98.995 14.495 98.995 13.848 M 94.180 5.104 C 95.434 5.104 96.688 5.104 97.942 5.104 C 97.921 5.461 97.900 5.819 97.878 6.175 C 98.208 5.742 98.571 5.419 98.968 5.205 C 99.364 4.991 99.798 4.885 100.268 4.885 C 100.842 4.885 101.336 5.040 101.751 5.351 C 102.172 5.657 102.435 6.011 102.538 6.413 C 102.642 6.816 102.694 7.500 102.694 8.464 C 102.694 10.170 102.694 11.876 102.694 13.582 C 102.694 14.687 102.627 15.474 102.492 15.944 C 102.364 16.408 102.096 16.780 101.687 17.061 C 101.284 17.336 100.796 17.473 100.222 17.473 C 99.764 17.473 99.340 17.366 98.949 17.153 C 98.559 16.939 98.202 16.622 97.878 16.200 C 97.878 17.128 97.878 18.056 97.878 18.984 C 96.645 18.984 95.412 18.984 94.180 18.984 C 94.180 14.357 94.180 9.731 94.180 5.104 M 92.751 2.422 C 92.751 7.366 92.751 12.309 92.751 17.253 C 91.463 17.253 90.176 17.253 88.888 17.253 C 88.888 13.298 88.888 9.343 88.888 5.388 C 88.506 5.388 88.125 5.388 87.743 5.388 C 87.743 9.343 87.743 13.298 87.743 17.253 C 86.456 17.253 85.168 17.253 83.880 17.253 C 83.880 12.309 83.880 7.366 83.880 2.422 C 86.837 2.422 89.794 2.422 92.751 2.422 Z"
            />
          </motion.g>
          <motion.g initial={{ opacity: 0 }} id="text5">
            <path
              id="S1"
              fill="#25657f"
              fillRule="evenodd"
              stroke="none"
              d="M 302.142 4.581 C 302.142 8.630 302.142 12.680 302.142 16.730 C 301.068 16.730 299.994 16.730 298.920 16.730 C 298.919 14.542 298.919 12.353 298.920 10.165 C 298.062 12.353 297.204 14.542 296.347 16.730 C 295.224 16.730 294.101 16.730 292.978 16.730 C 292.978 12.680 292.978 8.630 292.978 4.581 C 294.052 4.581 295.126 4.581 296.200 4.581 C 296.200 6.750 296.200 8.920 296.200 11.090 C 297.043 8.920 297.885 6.750 298.727 4.581 C 299.866 4.581 301.004 4.581 302.142 4.581 M 291.659 4.581 C 291.659 8.630 291.659 12.680 291.659 16.730 C 290.433 16.730 289.206 16.730 287.979 16.730 C 287.979 15.237 287.979 13.745 287.979 12.253 C 287.536 12.253 287.094 12.253 286.651 12.253 C 286.651 13.745 286.651 15.237 286.651 16.730 C 285.428 16.730 284.204 16.730 282.980 16.730 C 282.980 12.680 282.980 8.630 282.980 4.581 C 284.204 4.581 285.428 4.581 286.651 4.581 C 286.651 6.036 286.651 7.492 286.651 8.948 C 287.094 8.948 287.536 8.948 287.979 8.948 C 287.979 7.492 287.979 6.036 287.979 4.581 C 289.206 4.581 290.433 4.581 291.659 4.581 M 281.277 9.405 C 281.058 9.759 280.655 10.031 280.069 10.220 C 280.649 10.403 281.076 10.672 281.351 11.026 C 281.625 11.380 281.763 11.932 281.763 12.683 C 281.763 13.513 281.702 14.117 281.579 14.496 C 281.457 14.868 281.219 15.250 280.865 15.640 C 280.517 16.025 280.038 16.302 279.428 16.473 C 278.818 16.644 278.140 16.730 277.395 16.730 C 275.912 16.730 274.875 16.440 274.283 15.860 C 273.691 15.280 273.395 14.227 273.395 12.701 C 273.395 12.405 273.395 12.109 273.395 11.813 C 274.563 11.813 275.732 11.813 276.901 11.813 C 276.901 12.384 276.901 12.955 276.901 13.525 C 276.901 14.136 277.115 14.441 277.542 14.441 C 277.768 14.441 277.939 14.355 278.055 14.184 C 278.177 14.007 278.238 13.550 278.238 12.811 C 278.238 12.555 278.238 12.299 278.238 12.042 C 278.238 11.688 278.119 11.444 277.881 11.310 C 277.643 11.175 277.148 11.108 276.398 11.108 C 276.398 10.532 276.398 9.955 276.398 9.378 C 276.492 9.378 276.587 9.378 276.681 9.378 C 277.200 9.378 277.539 9.366 277.698 9.341 C 277.856 9.317 277.984 9.231 278.082 9.085 C 278.186 8.932 278.238 8.679 278.238 8.325 C 278.238 8.240 278.238 8.154 278.238 8.069 C 278.238 7.550 278.180 7.220 278.064 7.080 C 277.954 6.940 277.792 6.869 277.579 6.869 C 277.127 6.869 276.901 7.138 276.901 7.675 C 276.901 8.005 276.901 8.334 276.901 8.664 C 275.732 8.664 274.563 8.664 273.395 8.664 C 273.395 8.484 273.395 8.304 273.395 8.124 C 273.395 6.842 273.706 5.933 274.328 5.395 C 274.957 4.852 276.004 4.581 277.469 4.581 C 278.873 4.581 279.913 4.840 280.591 5.359 C 281.268 5.878 281.607 6.680 281.607 7.767 C 281.607 8.499 281.497 9.045 281.277 9.405 M 272.195 4.581 C 272.195 8.630 272.195 12.680 272.195 16.730 C 271.121 16.730 270.047 16.730 268.973 16.730 C 268.973 14.542 268.973 12.353 268.973 10.165 C 268.115 12.353 267.257 14.542 266.400 16.730 C 265.277 16.730 264.154 16.730 263.031 16.730 C 263.031 12.680 263.031 8.630 263.031 4.581 C 264.105 4.581 265.179 4.581 266.254 4.581 C 266.253 6.750 266.253 8.920 266.254 11.090 C 267.096 8.920 267.938 6.750 268.780 4.581 C 269.919 4.581 271.057 4.581 272.195 4.581 M 261.850 14.963 C 261.850 15.744 261.987 16.333 262.262 16.730 C 261.072 16.730 259.881 16.730 258.691 16.730 C 258.417 16.357 258.279 15.881 258.279 15.301 C 258.279 14.447 258.279 13.592 258.279 12.738 C 258.279 11.914 257.886 11.502 257.098 11.502 C 257.098 13.245 257.098 14.987 257.098 16.730 C 255.881 16.730 254.663 16.730 253.445 16.730 C 253.445 14.987 253.445 13.245 253.445 11.502 C 252.780 11.502 252.447 11.914 252.447 12.738 C 252.447 13.592 252.447 14.447 252.447 15.301 C 252.447 16.132 252.310 16.608 252.035 16.730 C 250.848 16.730 249.661 16.730 248.474 16.730 C 248.749 16.333 248.886 15.744 248.886 14.963 C 248.886 14.252 248.886 13.541 248.886 12.829 C 248.886 11.822 249.518 11.117 250.781 10.715 C 251.135 10.599 251.535 10.498 251.980 10.413 C 251.767 10.400 251.355 10.293 250.744 10.092 C 250.128 9.805 249.725 9.579 249.536 9.415 C 249.115 9.054 248.904 8.575 248.904 7.977 C 248.904 7.431 248.904 6.885 248.904 6.338 C 248.904 5.563 248.767 4.977 248.492 4.581 C 249.679 4.581 250.867 4.581 252.054 4.581 C 252.334 4.953 252.475 5.429 252.475 6.009 C 252.475 6.696 252.475 7.382 252.475 8.069 C 252.475 8.893 252.798 9.305 253.445 9.305 C 253.445 7.730 253.445 6.155 253.445 4.581 C 254.663 4.581 255.881 4.581 257.098 4.581 C 257.098 6.155 257.098 7.730 257.098 9.305 C 257.873 9.305 258.261 8.893 258.261 8.069 C 258.261 7.382 258.261 6.696 258.261 6.009 C 258.261 5.179 258.398 4.703 258.673 4.581 C 259.863 4.581 261.053 4.581 262.243 4.581 C 261.963 4.977 261.822 5.563 261.822 6.338 C 261.822 6.885 261.822 7.431 261.822 7.977 C 261.822 8.575 261.615 9.054 261.200 9.415 C 261.011 9.579 260.608 9.805 259.991 10.092 C 259.619 10.263 259.207 10.370 258.755 10.413 C 258.963 10.449 259.363 10.550 259.955 10.715 C 261.218 11.117 261.850 11.822 261.850 12.829 C 261.850 13.541 261.850 14.252 261.850 14.963 M 239.731 9.579 C 239.914 9.756 240.243 9.845 240.719 9.845 C 240.719 8.878 240.719 7.910 240.719 6.943 C 240.594 6.943 240.469 6.943 240.344 6.943 C 240.076 6.943 239.862 7.022 239.703 7.181 C 239.545 7.333 239.465 7.696 239.465 8.270 C 239.465 8.322 239.465 8.374 239.465 8.426 C 239.465 9.012 239.554 9.396 239.731 9.579 M 244.400 4.581 C 244.400 8.630 244.400 12.680 244.400 16.730 C 243.173 16.730 241.946 16.730 240.719 16.730 C 240.719 15.137 240.719 13.544 240.719 11.951 C 240.243 11.951 239.914 12.051 239.731 12.253 C 239.554 12.454 239.465 12.833 239.465 13.388 C 239.465 14.502 239.465 15.616 239.465 16.730 C 238.336 16.730 237.207 16.730 236.078 16.730 C 236.078 15.781 236.078 14.831 236.078 13.882 C 236.078 13.156 236.117 12.634 236.197 12.317 C 236.276 11.993 236.456 11.740 236.737 11.557 C 237.024 11.374 237.509 11.191 238.193 11.008 C 237.308 10.928 236.734 10.678 236.471 10.257 C 236.209 9.830 236.078 9.070 236.078 7.977 C 236.078 6.769 236.426 5.902 237.121 5.377 C 237.823 4.846 239.337 4.581 241.662 4.581 C 242.575 4.581 243.487 4.581 244.400 4.581 M 234.695 6.522 C 234.921 7.144 235.034 8.026 235.034 9.167 C 233.871 9.167 232.709 9.167 231.546 9.167 C 231.546 8.701 231.546 8.234 231.546 7.767 C 231.546 7.278 231.506 6.949 231.427 6.778 C 231.348 6.601 231.201 6.512 230.987 6.512 C 230.774 6.512 230.630 6.589 230.557 6.741 C 230.484 6.894 230.447 7.236 230.447 7.767 C 230.447 9.677 230.447 11.587 230.447 13.498 C 230.447 13.931 230.502 14.258 230.612 14.477 C 230.722 14.691 230.884 14.798 231.097 14.798 C 231.348 14.798 231.515 14.685 231.601 14.459 C 231.692 14.233 231.738 13.806 231.738 13.177 C 231.738 12.695 231.738 12.213 231.738 11.731 C 232.837 11.731 233.935 11.731 235.034 11.731 C 235.028 12.701 234.991 13.431 234.924 13.919 C 234.863 14.401 234.659 14.899 234.311 15.411 C 233.969 15.918 233.520 16.302 232.965 16.565 C 232.410 16.821 231.723 16.949 230.905 16.949 C 229.861 16.949 229.034 16.772 228.424 16.418 C 227.814 16.058 227.380 15.558 227.124 14.917 C 226.874 14.270 226.749 13.354 226.749 12.170 C 226.749 11.020 226.749 9.869 226.749 8.719 C 226.749 7.687 226.852 6.909 227.060 6.384 C 227.267 5.859 227.710 5.392 228.387 4.983 C 229.065 4.568 229.889 4.361 230.859 4.361 C 231.824 4.361 232.648 4.565 233.331 4.974 C 234.015 5.383 234.469 5.899 234.695 6.522 M 221.731 13.992 C 221.908 13.864 221.997 13.470 221.997 12.811 C 221.997 12.649 221.997 12.488 221.997 12.326 C 221.997 11.697 221.933 11.316 221.805 11.182 C 221.683 11.047 221.329 10.971 220.743 10.953 C 220.743 12.027 220.743 13.101 220.743 14.175 C 221.231 14.175 221.561 14.114 221.731 13.992 M 225.677 12.024 C 225.677 12.436 225.677 12.848 225.677 13.260 C 225.677 14.371 225.546 15.167 225.284 15.649 C 225.027 16.132 224.621 16.434 224.066 16.556 C 223.511 16.672 222.604 16.730 221.347 16.730 C 219.922 16.730 218.497 16.730 217.071 16.730 C 217.071 12.680 217.071 8.630 217.071 4.581 C 218.295 4.581 219.519 4.581 220.743 4.581 C 220.743 5.930 220.743 7.278 220.743 8.627 C 220.944 8.627 221.145 8.627 221.347 8.627 C 222.525 8.627 223.404 8.697 223.984 8.838 C 224.563 8.978 224.991 9.286 225.265 9.762 C 225.540 10.239 225.677 10.992 225.677 12.024 M 208.401 4.581 C 211.044 4.581 213.687 4.581 216.330 4.581 C 216.330 5.429 216.330 6.277 216.330 7.126 C 215.625 7.126 214.920 7.126 214.215 7.126 C 214.215 10.327 214.215 13.528 214.215 16.730 C 212.985 16.730 211.755 16.730 210.525 16.730 C 210.525 13.528 210.525 10.327 210.525 7.126 C 209.817 7.126 209.109 7.126 208.401 7.126 C 208.401 6.277 208.401 5.429 208.401 4.581 M 204.034 13.452 C 204.034 12.619 204.034 11.786 204.034 10.953 C 203.442 11.386 203.097 11.749 203.000 12.042 C 202.908 12.335 202.862 12.756 202.862 13.306 C 202.862 13.934 202.902 14.340 202.981 14.523 C 203.067 14.706 203.232 14.798 203.476 14.798 C 203.708 14.798 203.857 14.728 203.924 14.587 C 203.998 14.441 204.034 14.062 204.034 13.452 M 202.862 8.014 C 202.862 8.438 202.862 8.862 202.862 9.286 C 201.706 9.286 200.549 9.286 199.393 9.286 C 199.393 9.015 199.393 8.743 199.393 8.472 C 199.393 7.532 199.499 6.808 199.713 6.302 C 199.933 5.789 200.369 5.337 201.022 4.947 C 201.675 4.556 202.524 4.361 203.567 4.361 C 204.819 4.361 205.762 4.584 206.396 5.029 C 207.031 5.469 207.413 6.012 207.541 6.659 C 207.669 7.300 207.733 8.624 207.733 10.632 C 207.733 12.665 207.733 14.697 207.733 16.730 C 206.534 16.730 205.334 16.730 204.135 16.730 C 204.135 16.370 204.135 16.009 204.135 15.649 C 203.909 16.083 203.616 16.409 203.256 16.629 C 202.902 16.843 202.478 16.949 201.983 16.949 C 201.337 16.949 200.741 16.769 200.198 16.409 C 199.661 16.043 199.393 15.246 199.393 14.020 C 199.393 13.687 199.393 13.354 199.393 13.022 C 199.393 12.112 199.536 11.493 199.823 11.163 C 200.110 10.834 200.821 10.449 201.956 10.010 C 203.171 9.534 203.821 9.213 203.906 9.048 C 203.992 8.884 204.034 8.548 204.034 8.041 C 204.034 7.407 203.985 6.995 203.888 6.805 C 203.796 6.610 203.641 6.512 203.421 6.512 C 203.171 6.512 203.015 6.595 202.954 6.760 C 202.893 6.918 202.862 7.336 202.862 8.014 M 194.568 13.965 C 194.726 13.818 194.806 13.483 194.806 12.958 C 194.806 12.820 194.806 12.683 194.806 12.546 C 194.806 12.021 194.736 11.694 194.595 11.566 C 194.455 11.432 194.119 11.365 193.588 11.365 C 193.588 12.302 193.588 13.238 193.588 14.175 C 194.083 14.175 194.409 14.105 194.568 13.965 M 193.588 7.126 C 193.588 7.782 193.588 8.438 193.588 9.094 C 194.150 9.094 194.491 9.024 194.613 8.884 C 194.742 8.743 194.806 8.465 194.806 8.050 C 194.806 7.703 194.736 7.461 194.595 7.327 C 194.455 7.193 194.119 7.126 193.588 7.126 M 198.486 12.811 C 198.486 13.049 198.486 13.287 198.486 13.525 C 198.486 14.764 198.215 15.610 197.671 16.061 C 197.134 16.507 195.962 16.730 194.156 16.730 C 192.743 16.730 191.330 16.730 189.917 16.730 C 189.917 12.680 189.917 8.630 189.917 4.581 C 191.373 4.581 192.828 4.581 194.284 4.581 C 195.779 4.581 196.808 4.828 197.369 5.322 C 197.937 5.817 198.221 6.662 198.221 7.858 C 198.221 9.231 197.507 10.013 196.078 10.202 C 196.823 10.324 197.409 10.617 197.836 11.081 C 198.270 11.539 198.486 12.115 198.486 12.811 M 185.000 13.534 C 185.000 11.667 185.000 9.799 185.000 7.931 C 185.000 7.309 184.967 6.918 184.900 6.760 C 184.833 6.595 184.689 6.512 184.469 6.512 C 184.250 6.512 184.103 6.595 184.030 6.760 C 183.957 6.918 183.920 7.309 183.920 7.931 C 183.920 9.759 183.920 11.587 183.920 13.415 C 183.920 13.989 183.957 14.365 184.030 14.542 C 184.103 14.712 184.247 14.798 184.460 14.798 C 184.680 14.798 184.823 14.719 184.891 14.560 C 184.964 14.401 185.000 14.059 185.000 13.534 M 188.516 6.924 C 188.638 7.345 188.699 7.986 188.699 8.847 C 188.699 9.839 188.699 10.831 188.699 11.822 C 188.699 12.915 188.644 13.718 188.534 14.230 C 188.425 14.737 188.190 15.213 187.829 15.658 C 187.469 16.098 187.005 16.424 186.438 16.638 C 185.876 16.846 185.229 16.949 184.497 16.949 C 183.679 16.949 182.986 16.861 182.419 16.684 C 181.851 16.501 181.409 16.229 181.091 15.869 C 180.780 15.503 180.557 15.063 180.423 14.551 C 180.289 14.032 180.221 13.257 180.221 12.225 C 180.221 11.188 180.221 10.150 180.221 9.112 C 180.221 7.983 180.343 7.101 180.588 6.467 C 180.832 5.832 181.271 5.322 181.906 4.938 C 182.541 4.553 183.353 4.361 184.341 4.361 C 185.171 4.361 185.882 4.486 186.474 4.736 C 187.073 4.980 187.533 5.301 187.857 5.698 C 188.180 6.094 188.400 6.503 188.516 6.924 M 172.888 13.809 C 173.575 13.809 174.261 13.809 174.948 13.809 C 174.948 11.645 174.948 9.482 174.948 7.318 C 174.627 7.318 174.307 7.318 173.987 7.318 C 173.987 9.704 173.620 11.825 172.888 13.809 M 173.987 7.318 C 173.987 7.361 173.987 7.404 173.987 7.446 M 179.407 13.809 C 179.406 15.564 179.406 17.319 179.407 19.073 C 178.583 19.073 177.759 19.073 176.935 19.073 C 176.935 18.292 176.935 17.511 176.935 16.730 C 174.859 16.730 172.784 16.730 170.709 16.730 C 170.709 17.511 170.709 18.292 170.709 19.073 C 169.885 19.073 169.061 19.073 168.237 19.073 C 168.237 17.325 168.237 15.576 168.237 13.827 C 168.500 13.827 168.762 13.827 169.025 13.827 C 169.494 13.101 169.879 11.975 170.178 10.449 C 170.483 8.917 170.636 7.110 170.636 5.029 C 170.636 4.880 170.636 4.730 170.636 4.581 C 173.297 4.581 175.958 4.581 178.619 4.581 C 178.619 7.657 178.619 10.733 178.619 13.809 C 178.882 13.809 179.144 13.809 179.407 13.809 M 163.678 13.452 C 163.678 12.619 163.678 11.786 163.678 10.953 C 163.086 11.386 162.741 11.749 162.643 12.042 C 162.552 12.335 162.506 12.756 162.506 13.306 C 162.506 13.934 162.546 14.340 162.625 14.523 C 162.710 14.706 162.875 14.798 163.119 14.798 C 163.351 14.798 163.501 14.728 163.568 14.587 C 163.641 14.441 163.678 14.062 163.678 13.452 M 162.506 8.014 C 162.506 8.438 162.506 8.862 162.506 9.286 C 161.349 9.286 160.193 9.286 159.036 9.286 C 159.036 9.015 159.036 8.743 159.036 8.472 C 159.036 7.532 159.143 6.808 159.357 6.302 C 159.576 5.789 160.013 5.337 160.666 4.947 C 161.319 4.556 162.167 4.361 163.211 4.361 C 164.462 4.361 165.405 4.584 166.040 5.029 C 166.675 5.469 167.056 6.012 167.184 6.659 C 167.312 7.300 167.377 8.624 167.377 10.632 C 167.376 12.665 167.376 14.697 167.377 16.730 C 166.177 16.730 164.978 16.730 163.779 16.730 C 163.778 16.370 163.778 16.009 163.779 15.649 C 163.553 16.083 163.260 16.409 162.900 16.629 C 162.546 16.843 162.121 16.949 161.627 16.949 C 160.980 16.949 160.385 16.769 159.842 16.409 C 159.305 16.043 159.036 15.246 159.036 14.020 C 159.036 13.687 159.036 13.354 159.036 13.022 C 159.036 12.112 159.180 11.493 159.466 11.163 C 159.753 10.834 160.464 10.449 161.600 10.010 C 162.814 9.534 163.464 9.213 163.550 9.048 C 163.635 8.884 163.678 8.548 163.678 8.041 C 163.678 7.407 163.629 6.995 163.531 6.805 C 163.440 6.610 163.284 6.512 163.064 6.512 C 162.814 6.512 162.659 6.595 162.598 6.760 C 162.536 6.918 162.506 7.336 162.506 8.014 M 154.742 4.672 C 154.584 4.520 154.254 4.443 153.754 4.443 C 153.753 5.701 153.753 6.958 153.754 8.215 C 153.863 8.221 153.958 8.224 154.037 8.224 C 154.391 8.224 154.635 8.139 154.770 7.968 C 154.910 7.791 154.980 7.428 154.980 6.879 C 154.980 6.473 154.980 6.067 154.980 5.661 C 154.980 5.154 154.901 4.825 154.742 4.672 M 149.899 16.730 C 149.899 11.789 149.899 6.848 149.899 1.907 C 151.193 1.907 152.487 1.907 153.781 1.907 C 154.831 1.907 155.636 1.990 156.198 2.154 C 156.766 2.319 157.190 2.557 157.471 2.869 C 157.757 3.180 157.950 3.558 158.047 4.004 C 158.151 4.443 158.203 5.127 158.203 6.055 C 158.203 6.485 158.203 6.915 158.203 7.345 C 158.203 8.292 158.105 8.981 157.910 9.415 C 157.715 9.848 157.355 10.181 156.830 10.413 C 156.311 10.644 155.630 10.760 154.788 10.760 C 154.443 10.760 154.098 10.760 153.754 10.760 C 153.753 12.750 153.753 14.740 153.754 16.730 C 152.469 16.730 151.184 16.730 149.899 16.730 Z"
            />
          </motion.g>
        </g>
      </motion.svg>
    </MotionConfig>
  );
};
